blog/2014/06/04/0-binder.org
#+title: binder
# bhj-tags: code-reading
关于android下的binder IPC机制，网上已经有不少人分析过了，我总是嫌看起
来有些雾里看花，所以一咬牙自己看一遍吧。

首先，众所周知，IPC也即进程间通信，Inter Process Communication，它的形
式非常多种多样，比大家所熟知的那几种要多得多。在我看来，一些普遍不被认
为是IPC的机制，其实也可以认为是一种IPC，只不过可能原始一点，或者不够健
壮。

比如文件，两个进程完全可以通过IPC来进行通信嘛。进程A先往文件
/tmp/ab-ipc-file写一句话，“今晚打老虎”，然后sleep 10秒，进程B读此文件，
回复“好的”（把“好的”写到这个文件里去，覆盖了原来的内容），然后退出，然
后A醒来，重新读一下这个文件，获得了B传给它的信息。这样，它们就完成了一
次双向的IPC。

如果把进程间通信跟人类之间的沟通做一个类比的话，能更深的理解的确有很多
种机制均可以被打破常规的认为是IPC。沟通指的是信息的交换。而信息之所以
成为信息，是因为它可以被交换。可以被产生，被观察到，被消化掉。一个只被
产生出来，却从来没有被观察、被消化过的信息，是无法想像的。是不存在的。
比如一个女人，生了一个孩子，这件事本身好像不存在信息交换，孩子刚出生，
还不会跟妈妈交换信息嘛。可如果把范围划得广一点，就会发现在生孩子的过程
中，发生了很多信息交换，比如孩子它爸不停地在妈妈身边喊，“加油！加油！”。
等等等等。产房外焦急等待的长辈在不停地poll产房里的情况...

可惜，把范围定得这么广的话我们就没法继续讨论下去了。所以我还是稍微收一
下。

Binder IPC机制跟其它常见的IPC机制一样，里面包含一些基本的元素：

- 参与者

  您肯定听说过，signal也是一种IPC机制，一个基本上是单向的IPC机制。进程
  A通过Kill命令/系统调用向进程B发一个信号，发送成功的话进程B可能会做出
  一些动作来响应这个信号。这里的A和B就是参与者。但有时候进程A是不存在
  的，比如当一个子进程退出的时候，父进程会收到一个sigchld的信号，但这
  个信号是sigchld是谁发给父进程的呢？刚刚退出的子进程发的吗？可它没有
  调过kill系统调用啊？答案是操作系统发的。所以进程间通讯真的不是那么绝
  对的。

  有时候进程间通讯可以是多方的，比如管道，大家可能会认为肯定只能是两方
  参与，但其实弄4个进程出来通过一个管道通信也不是什么难事：

  #+BEGIN_EXAMPLE
  (echo hello; echo world) | ( dd bs=1 count=6 && perl -npe '' )
  #+END_EXAMPLE

  这些参与者参与到某种通信机制的方式随机制的不同而不同。比如signal机制，
  我可以写这样的一段淘气的脚本，不停地随机地给系统中的进程发
  sigkill（其中random是一个附助的生成随机整数的脚本）：

  #+BEGIN_SRC sh
  while true; do kill -9 $(random); done
  #+END_SRC

  而上面那一段4方管道，显然需要有一个父进程(bash)帮助把这个管道创建出
  来，把子进程创建出来，把输入输出配置好，再把相应的程序执行起来。

  而Binder机制里，系统中所有的进程都可以参与其中，只要它们打开了
  /dev/binder这个设备节点就可以。但其中有一个比较特殊一点，一般是第一
  个打开/dev/binder节点并成为context manager的那个进程。


  * 角色

    对，IPC中的各方是可以有不同的角色的。比如signal，有一个杀的，有一
    个被杀的（kill:-)）。

    而在Binder通讯机制里，有一个角色比较特殊，那就是context manager。
    这个在kernel里是叫context manager，其实在user space里是叫service
    manager。它允许系统里其它进程向它注册，比如这个进程向service
    manager注册：“我的进程号是NNNN，我的名字叫media server”，以后别的
    进程想进行多媒体相关的调用的话，就会向service manager查询，“media
    server”的进程是哪个？

    所以除了这个service manager之外，可以有很多其他的server，其实
    service manager自身也是一个server，只不过是最特殊的那个罢了。其他
    所有server都要向它来注册。

大体看过Binder的一些特点之后，我们来场景分析一下Binder相关的一些细节。
您可以别看了，我写得太乱了...


* Binder是一种面向对象的IPC机制

作为一种很牛逼的IPC机制，Binder想要作到让跨进程间通讯的远程调用，使用
起来感觉就像是进程内的函数调用一样。这个就有难度了。让我们来看看它是怎
么实现的。

首先，在远程server端会实现一套接口（Interface）。啊，算了，让我们先来
说一说如果没有binder机制，我们会怎么样来实现远程通讯吧。

我最熟悉的远程通讯就是tcp/ip了，这个通讯机制非常的通用，我们就不提那些
大家都熟知的http/ftp/ssh/telnet等协议了。

我曾经实现过一个手机测试命令工具箱，tcmd，采用了server/client机制实现。
首先一个server在一端监听某tcp端口，比如54321，客户端会给它发一个命令，
比如wifi-off，那么服务端读到这个命令之后，会以这样的代码去做相应的事情：

#+BEGIN_SRC c
    read(socket, cmd ...
    if (strcmp(cmd, "wifi-on") == 0) {
        wifi_on();
    } else if (strcmp(cmd, "wifi-off") == 0) {
        wifi_off();
    } else if ...

void wifi_off()
{
    write 0 /sys/wifi/power
}
#+END_SRC

也就是说，服务端系统会根据读到不同的命令去封装不同的函数。

比较妙的是，在客户端系统会去实现类似的逻辑，只不过是反过来，像一面镜子，它是往socket里写：

#+BEGIN_SRC c
void client_wifi_on()
{
    socket = open_socket("localhost", 54321);
    write(socket, "wifi-on"...
    close(socket);
}

void client_wifi_off()
{
    socket = open_socket("localhost", 54321);
    write(socket, "wifi-off"...
    close(socket);
}
#+END_SRC

这里你也看到了，我们可以像模板一样，生成很多的函数，每个函数做一个命令。
当然，没有什么能阴止你使用跟server端一样的名字，比如你的
=client_wifi_off= 完全也可以叫做 =wifi_off= ，这样做是有好处的，使两个本来非
常相关的函数变得更紧密了，但也有坏处，阅读代码的时候常常不知道该看哪个。
其实看多了很快会明白，所有的client端的实现都是个模板而已（boilerplate）。

然而我也非常喜欢这样的client实现：

#+BEGIN_SRC c
void test_cmd(const char *cmd)
{
    socket = open_socket("localhost", 54321);
    write(socket, cmd...
    close(socket);
}
#+END_SRC

然后再用到 =client_wifi_on()= 的地方就代以 =test_cmd("wifi-on")= ，在用到
=wifi_off()= 的地方就代以 =test_cmd("wifi-off")= ，等等。这样做的好处是少了很
多函数和很多boilerplate代码（每个命令都要open/close socket！）。

当然，你也可以再在 =test_cmd= 的基础上把 =wifi_on/wifi_off= 给包装出来：

#+BEGIN_SRC c
void wifi_on()
{
    test_cmd("wifi-on");
}
#+END_SRC

太棒了，这就跟我们最终要看的binder机制有点像了。好，我们接着来看一下
binder机制是怎么做的。

