blog/2014/06/04/0-binder.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>binder</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Bao Haojun" />
<link rel="stylesheet" href="/css/default.css" type="text/css" />
<link rel="stylesheet" href="/css/adwaita.css" type="text/css" />
 <link rel="shortcut icon" href="/poison.png" type="image/png" />

</head>
<body>
<div id="preamble" class="status">
<div id="header">

  <h1 id="blog-title">

    <a href="http://baohaojun.github.io/blog/2011/12/23/index.html">包昊军的博客</a>

  </h1>
  <p id="description">What you don't know, won't hurt you.</p>

</div>
</div>
<div id='bhj_article'>
  <div id='bhj_leftpane'>
<div id="content">
<h1 class="title">binder</h1>
<p>
关于android下的binder IPC机制，网上已经有不少人分析过了，我总是嫌看起
来有些雾里看花，所以一咬牙自己看一遍吧。
</p>

<p>
首先，众所周知，IPC也即进程间通信，Inter Process Communication，它的形
式非常多种多样，比大家所熟知的那几种要多得多。在我看来，一些普遍不被认
为是IPC的机制，其实也可以认为是一种IPC，只不过可能原始一点，或者不够健
壮。
</p>

<p>
比如文件，两个进程完全可以通过IPC来进行通信嘛。进程A先往文件
/tmp/ab-ipc-file写一句话，“今晚打老虎”，然后sleep 10秒，进程B读此文件，
回复“好的”（把“好的”写到这个文件里去，覆盖了原来的内容），然后退出，然
后A醒来，重新读一下这个文件，获得了B传给它的信息。这样，它们就完成了一
次双向的IPC。
</p>

<p>
如果把进程间通信跟人类之间的沟通做一个类比的话，能更深的理解的确有很多
种机制均可以被打破常规的认为是IPC。沟通指的是信息的交换。而信息之所以
成为信息，是因为它可以被交换。可以被产生，被观察到，被消化掉。一个只被
产生出来，却从来没有被观察、被消化过的信息，是无法想像的。是不存在的。
比如一个女人，生了一个孩子，这件事本身好像不存在信息交换，孩子刚出生，
还不会跟妈妈交换信息嘛。可如果把范围划得广一点，就会发现在生孩子的过程
中，发生了很多信息交换，比如孩子它爸不停地在妈妈身边喊，“加油！加油！”。
等等等等。产房外焦急等待的长辈在不停地poll产房里的情况&#x2026;
</p>

<p>
可惜，把范围定得这么广的话我们就没法继续讨论下去了。所以我还是稍微收一
下。
</p>

<p>
Binder IPC机制跟其它常见的IPC机制一样，里面包含一些基本的元素：
</p>

<ul class="org-ul">
<li>参与者

<p>
您肯定听说过，signal也是一种IPC机制，一个基本上是单向的IPC机制。进程
A通过Kill命令/系统调用向进程B发一个信号，发送成功的话进程B可能会做出
一些动作来响应这个信号。这里的A和B就是参与者。但有时候进程A是不存在
的，比如当一个子进程退出的时候，父进程会收到一个sigchld的信号，但这
个信号是sigchld是谁发给父进程的呢？刚刚退出的子进程发的吗？可它没有
调过kill系统调用啊？答案是操作系统发的。所以进程间通讯真的不是那么绝
对的。
</p>

<p>
有时候进程间通讯可以是多方的，比如管道，大家可能会认为肯定只能是两方
参与，但其实弄4个进程出来通过一个管道通信也不是什么难事：
</p>

<pre class="example">
(echo hello; echo world) | ( dd bs=1 count=6 &amp;&amp; perl -npe '' )
</pre>

<p>
这些参与者参与到某种通信机制的方式随机制的不同而不同。比如signal机制，
我可以写这样的一段淘气的脚本，不停地随机地给系统中的进程发
sigkill（其中random是一个附助的生成随机整数的脚本）：
</p>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-keyword">while</span> true; <span class="org-keyword">do </span><span class="org-builtin">kill</span> -9 $(<span class="org-sh-quoted-exec">random</span>); <span class="org-keyword">done</span>
</pre>
</div>

<p>
而上面那一段4方管道，显然需要有一个父进程(bash)帮助把这个管道创建出
来，把子进程创建出来，把输入输出配置好，再把相应的程序执行起来。
</p>

<p>
而Binder机制里，系统中所有的进程都可以参与其中，只要它们打开了
/dev/binder这个设备节点就可以。但其中有一个比较特殊一点，一般是第一
个打开/dev/binder节点并成为context manager的那个进程。
</p>
</li>
</ul>


<ul class="org-ul">
<li>角色

<p>
对，IPC中的各方是可以有不同的角色的。比如signal，有一个杀的，有一
个被杀的（kill:-)）。
</p>

<p>
而在Binder通讯机制里，有一个角色比较特殊，那就是context manager。
这个在kernel里是叫context manager，其实在user space里是叫service
manager。它允许系统里其它进程向它注册，比如这个进程向service
manager注册：“我的进程号是NNNN，我的名字叫media server”，以后别的
进程想进行多媒体相关的调用的话，就会向service manager查询，“media
server”的进程是哪个？
</p>

<p>
所以除了这个service manager之外，可以有很多其他的server，其实
service manager自身也是一个server，只不过是最特殊的那个罢了。其他
所有server都要向它来注册。
</p>
</li>
</ul>

<p>
大体看过Binder的一些特点之后，我们来场景分析一下Binder相关的一些细节。
您可以别看了，我写得太乱了&#x2026;
</p>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Binder是一种面向对象的IPC机制</h2>
<div class="outline-text-2" id="text-1">
<p>
作为一种很牛逼的IPC机制，Binder想要作到让跨进程间通讯的远程调用，使用
起来感觉就像是进程内的函数调用一样。这个就有难度了。让我们来看看它是怎
么实现的。
</p>

<p>
首先，在远程server端会实现一套接口（Interface）。啊，算了，让我们先来
说一说如果没有binder机制，我们会怎么样来实现远程通讯吧。
</p>

<p>
我最熟悉的远程通讯就是tcp/ip了，这个通讯机制非常的通用，我们就不提那些
大家都熟知的http/ftp/ssh/telnet等协议了。
</p>

<p>
我曾经实现过一个手机测试命令工具箱，tcmd，采用了server/client机制实现。
首先一个server在一端监听某tcp端口，比如54321，客户端会给它发一个命令，
比如wifi-off，那么服务端读到这个命令之后，会以这样的代码去做相应的事情：
</p>

<div class="org-src-container">

<pre class="src src-c">    read(socket, cmd ...
    <span class="org-keyword">if</span> (strcmp(cmd, <span class="org-string">"wifi-on"</span>) == 0) {
        wifi_on();
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (strcmp(cmd, <span class="org-string">"wifi-off"</span>) == 0) {
        wifi_off();
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> ...

<span class="org-type">void</span> wifi_off()
{
    write 0 /sys/wifi/power
}
</pre>
</div>

<p>
也就是说，服务端系统会根据读到不同的命令去封装不同的函数。
</p>

<p>
比较妙的是，在客户端系统会去实现类似的逻辑，只不过是反过来，像一面镜子，它是往socket里写：
</p>

<div class="org-src-container">

<pre class="src src-c"><span class="org-type">void</span> <span class="org-function-name">client_wifi_on</span>()
{
    socket = open_socket(<span class="org-string">"localhost"</span>, 54321);
    write(socket, <span class="org-string">"wifi-on"</span>...
    close(socket);
}

<span class="org-type">void</span> <span class="org-variable-name">client_wifi_off</span>()
{
    socket = open_socket(<span class="org-string">"localhost"</span>, 54321);
    write(socket, <span class="org-string">"wifi-off"</span>...
    close(socket);
}
</pre>
</div>

<p>
这里你也看到了，我们可以像模板一样，生成很多的函数，每个函数做一个命令。
当然，没有什么能阴止你使用跟server端一样的名字，比如你的
<code>client_wifi_off</code> 完全也可以叫做 <code>wifi_off</code> ，这样做是有好处的，使两个本来非
常相关的函数变得更紧密了，但也有坏处，阅读代码的时候常常不知道该看哪个。
其实看多了很快会明白，所有的client端的实现都是个模板而已（boilerplate）。
</p>

<p>
然而我也非常喜欢这样的client实现：
</p>

<div class="org-src-container">

<pre class="src src-c"><span class="org-type">void</span> <span class="org-function-name">test_cmd</span>(<span class="org-keyword">const</span> <span class="org-type">char</span> *<span class="org-variable-name">cmd</span>)
{
    socket = open_socket(<span class="org-string">"localhost"</span>, 54321);
    write(socket, <span class="org-type">cmd</span>...
    <span class="org-variable-name">close</span>(socket);
}
</pre>
</div>

<p>
然后再用到 <code>client_wifi_on()</code> 的地方就代以 <code>test_cmd("wifi-on")</code> ，在用到
<code>wifi_off()</code> 的地方就代以 <code>test_cmd("wifi-off")</code> ，等等。这样做的好处是少了很
多函数和很多boilerplate代码（每个命令都要open/close socket！）。
</p>

<p>
当然，你也可以再在 <code>test_cmd</code> 的基础上把 <code>wifi_on/wifi_off</code> 给包装出来：
</p>

<div class="org-src-container">

<pre class="src src-c"><span class="org-type">void</span> <span class="org-function-name">wifi_on</span>()
{
    test_cmd(<span class="org-string">"wifi-on"</span>);
}
</pre>
</div>

<p>
太棒了，这就跟我们最终要看的binder机制有点像了。好，我们接着来看一下
binder机制是怎么做的。
</p>
</div>
