blog/2014/06/04/0-binder.org
** 接口、继承树

Binder机制从最底层讲，只是数据的封装、传送、解析而已，所以它并不是只有
特定语言可以使用的，至少在Android系统里C/C++/Java都可以使用Binder。

但它最重要的优点之一，应该是它与面向对象编程之间比较友好的关系。我们就
先来看看Java里面是怎么使用Binder机制的。

题外话：我在用ajoke.el/beagrep/ctags/global等开源软件阅读源代码，以下
会有一些这些工具的运行结果。

以MountService.java为例，它有一个shutdown函数，我们看看它是哪个binder
的：

#+BEGIN_SRC compout
-*- mode: compilation; default-directory: "~/src/android/frameworks/base/services/java/com/android/server/" -*-
Compilation started at Sat Jun 21 21:24:30

ajoke-get-hierarchy.pl com.android.server.MountService -m shutdown
make: Entering directory `/home/bhj/src/android'

=> class com.android.server.MountService at frameworks/base/services/java/com/android/server/MountService.java line 103.
      public void shutdown(final IMountShutdownObserver observer){
   => class android.os.storage.IMountService.Stub at frameworks/base/core/java/android/os/storage/IMountService.java line 37.
      => class android.os.Binder at frameworks/base/core/java/android/os/Binder.java line 43.
         => interface android.os.IBinder at frameworks/base/core/java/android/os/IBinder.java line 86.
         => class java.lang.Object at libcore/luni/src/main/java/java/lang/Object.java line 131.
      => interface android.os.storage.IMountService at frameworks/base/core/java/android/os/storage/IMountService.java line 35.
            public void shutdown(IMountShutdownObserver observer)throws RemoteException;
         => interface android.os.IInterface at frameworks/base/core/java/android/os/IInterface.java line 23.
   => interface com.android.server.INativeDaemonConnectorCallbacks at frameworks/base/services/java/com/android/server/INativeDaemonConnectorCallbacks.java line 20.
   => interface com.android.server.Watchdog.Monitor at frameworks/base/services/java/com/android/server/Watchdog.java line 170.

Compilation finished at Sat Jun 21 21:24:31
#+END_SRC

哦，对了，你看到的上面这段代码就是它在我的Emacs编辑器里显示的样子，为
了让它正确的代码高亮，我还颇费了一番功夫呢！首先，上面的代码是
compilation-mode，这个在Emacs里是一种read-only的模式，然而org-html-fontify-code的代码是这样写的：

#+BEGIN_SRC emacs-lisp
          (setq code (with-temp-buffer
                       ;; Switch to language-specific mode.
                       (funcall lang-mode)
                       (insert code)
                       ;; Fontify buffer.
                       (font-lock-fontify-buffer)
#+END_SRC

可见，它先设置了mode =(funcall lang-mode)= 为compilation-mode，然后再
插入code =(insert code)= ，这就出问题了，compilation-mode是只读的，不
允许插入。为了绕过这个问题，我定义了一种新的compout-mode，很简单，就是可写的compilation-mode：

#+BEGIN_SRC emacs-lisp
(defun compout-mode ()
  "compilation mode, which is not buffer readonly for org export"
  (interactive)
  (compilation-mode)
  (setq buffer-read-only nil))
#+END_SRC

另外，做成这样之后，还是有问题，上面的代码输出到html之后没有全部高亮，
经查，应该是compilation-mode对temp-buffer有歧视，在temp-buffer里不会最
努力地高亮（见上面的 =with-temp-buffer= ）。

=with-temp-buffer= 的定义是这样的：

#+BEGIN_SRC emacs-lisp
(defmacro with-temp-buffer (&rest body)
  "Create a temporary buffer, and evaluate BODY there like `progn'.
See also `with-temp-file' and `with-output-to-string'."
  (declare (indent 0) (debug t))
  (let ((temp-buffer (make-symbol "temp-buffer")))
    `(let ((,temp-buffer (generate-new-buffer " *temp*")))
       ;; FIXME: kill-buffer can change current-buffer in some odd cases.
       (with-current-buffer ,temp-buffer
         (unwind-protect
             (progn ,@body)
           (and (buffer-name ,temp-buffer)
                (kill-buffer ,temp-buffer)))))))
#+END_SRC

问题出在 =(generate-new-buffer " *temp*")= 这个语句，buffer名字不能叫
=*temp*= ，所以我定义了一个advice来绕开这个问题：

#+BEGIN_SRC emacs-lisp
(defun org-html-fontify-code-compout (orig-fun &rest args)
  "Make compilation output htmlized."
  (if (string= (cadr args) "compout")
      (flet ((generate-new-buffer (name)
                                  (when (string= name " *temp*")
                                    (setq name "temp-ox"))
                                  (get-buffer-create (generate-new-buffer-name name))))
        (apply orig-fun args))
    (apply orig-fun args)))

(eval-after-load 'ox-html
  '(advice-add 'org-html-fontify-code :around #'org-html-fontify-code-compout))
#+END_SRC

当第二个参数 =(cadr args)= 为 "compout" 时，让generate-new-buffer的定
义发生变化，如果其参数名为 =*temp*= ，则改成 temp-ox 。

好了，从上面我用 ajoke-get-hierarchy 搞出来的继承树来看， shutdown 函数最早是在IMountService里定义的：

#+BEGIN_SRC compout
      => interface android.os.storage.IMountService at frameworks/base/core/java/android/os/storage/IMountService.java line 35.
            public void shutdown(IMountShutdownObserver observer)throws RemoteException;
#+END_SRC

#+BEGIN_SRC grepout
-*- mode: grep; default-directory: "~/src/android/frameworks/base/core/java/android/os/" -*-
Grep started at Fri Jul 25 10:02:01

grep-func-call -e "IMountService.*asInterface" --nc -a -v /tests/


Entering directory `/home/bhj/src/android/frameworks/base/core/java/android/app'
ContextImpl.java:2172: <=     private File[] ensureDirsExistOrFilter(File[] dirs) {
ContextImpl.java:2182: =>                         final IMountService mount = IMountService.Stub.asInterface(
Entering directory `/home/bhj/src/android/frameworks/base/core/java/android/os'
Environment.java:74: <=     private static StorageVolume getPrimaryVolume() {
Environment.java:83: =>                         IMountService mountService = IMountService.Stub.asInterface(ServiceManager
Environment.java:707: <=     public static String getStorageState(File path) {
Environment.java:717: =>             final IMountService mountService = IMountService.Stub.asInterface(
Entering directory `/home/bhj/src/android/frameworks/base/core/java/android/os/storage'
IMountService.java:836: <>         public static IMountService asInterface(IBinder obj) {
IMountService.java:857: <=         public boolean onTransact(int code, Parcel data, Parcel reply,
IMountService.java:867: =>                     listener = IMountServiceListener.Stub.asInterface(data.readStrongBinder());
IMountService.java:875: =>                     listener = IMountServiceListener.Stub.asInterface(data.readStrongBinder());
Entering directory `/home/bhj/src/android/frameworks/base/core/java/android/os/storage'
StorageManager.java:315: <=     public StorageManager(ContentResolver resolver, Looper tgtLooper) throws RemoteException {
StorageManager.java:318: =>         mMountService = IMountService.Stub.asInterface(ServiceManager.getService("mount"));
Entering directory `/home/bhj/src/android/frameworks/base/core/java/com/android/internal/content'
PackageHelper.java:61: <=     public static IMountService getMountService() throws RemoteException {
PackageHelper.java:64: =>             return IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/frameworks/base/core/java/com/android/internal/os/storage'
ExternalStorageFormatter.java:319: <=     IMountService getMountService() {
ExternalStorageFormatter.java:323: =>                 mMountService = IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/frameworks/base/core/java/com/android/internal/widget'
LockPatternUtils.java:632: <=     private void updateEncryptionPassword(String password) {
LockPatternUtils.java:645: =>         IMountService mountService = IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/frameworks/base/packages/BackupRestoreConfirmation/src/com/android/backupconfirm'
BackupRestoreConfirmation.java:131: <=     public void onCreate(Bundle icicle) {
BackupRestoreConfirmation.java:159: =>         mMountService = IMountService.Stub.asInterface(ServiceManager.getService("mount"));
Entering directory `/home/bhj/src/android/frameworks/base/packages/SystemUI/src/com/android/systemui/usb'
UsbStorageActivity.java:202: <=     private IMountService getMountService() {
UsbStorageActivity.java:205: =>             return IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/frameworks/base/services/java/com/android/server'
BackupManagerService.java:773: <=     public BackupManagerService(Context context) {
BackupManagerService.java:781: =>         mMountService = IMountService.Stub.asInterface(ServiceManager.getService("mount"));
Entering directory `/home/bhj/src/android/frameworks/base/services/java/com/android/server/power'
ShutdownThread.java:295: <=     public void run() {
ShutdownThread.java:374: =>                 final IMountService mount = IMountService.Stub.asInterface(
Entering directory `/home/bhj/src/android/packages/apps/SettingsSmartisan/src/com/android/settings'
CryptKeeperConfirm.java:41: <=         public void onCreate(Bundle savedInstanceState) {
CryptKeeperConfirm.java:72: =>                     IMountService mountService = IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/packages/apps/SettingsSmartisan/src/com/android/settings'
CryptKeeper.java:614: <=     private IMountService getMountService() {
CryptKeeper.java:617: =>             return IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/packages/apps/SettingsSmartisan/src/com/android/settings/deviceinfo'
Memory.java:214: <=     private synchronized IMountService getMountService() {
Memory.java:218: =>                mMountService = IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/packages/apps/Settings/src/com/android/settings'
CryptKeeperConfirm.java:41: <=         public void onCreate(Bundle savedInstanceState) {
CryptKeeperConfirm.java:72: =>                     IMountService mountService = IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/packages/apps/Settings/src/com/android/settings'
CryptKeeper.java:614: <=     private IMountService getMountService() {
CryptKeeper.java:617: =>             return IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/packages/apps/Settings/src/com/android/settings/deviceinfo'
Memory.java:203: <=     private synchronized IMountService getMountService() {
Memory.java:207: =>                mMountService = IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/packages/apps/SystemUISmartisan/src/com/smartisanos/systemui/usb'
UsbStorageActivity.java:204: <=     private IMountService getMountService() {
UsbStorageActivity.java:207: =>             return IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/vendor/qcom/proprietary/QualcommSettings/src/com/qualcomm/qualcommsettings'
QualcommSettings.java:687: <=    private void updateUsbMassStorageStatus() {
QualcommSettings.java:689: =>         IMountService mountService = IMountService.Stub.asInterface(ServiceManager

Grep finished (matches found) at Fri Jul 25 10:02:02
#+END_SRC

啊，还是看一看shutdown在I?MountService里都有谁定义的：

#+BEGIN_SRC grepout
-*- mode: grep; default-directory: "~/src/android/frameworks/base/core/java/android/os/storage/" -*-
Grep started at Fri Jul 25 10:17:13

grep-gtags -e "shutdown" -p MountServ
Found total 4/1728 definitions: Entering directory `/home/bhj/src/android'
frameworks/base/core/java/android/os/storage/IMountService.java:451: method: <android.os.storage.IMountService.Stub.Proxy.shutdown> : public void shutdown(IMountShutdownObserver observer) throws RemoteException {
frameworks/base/core/java/android/os/storage/IMountService.java:1310: method: <android.os.storage.IMountService.shutdown> : public void shutdown(IMountShutdownObserver observer) throws RemoteException;
frameworks/base/services/java/com/android/server/MountService.java:1423: method: <com.android.server.MountService.shutdown> : public void shutdown(final IMountShutdownObserver observer) {
frameworks/base/libs/storage/IMountService.cpp:403: function: <android::BpMountService::shutdown> : void shutdown(const sp<IMountShutdownObserver>& observer) {
    403:     void shutdown(const sp<IMountShutdownObserver>& observer)
    404:     {
    405:         Parcel data, reply;
    406:         data.writeInterfaceToken(IMountService::getInterfaceDescriptor());
    407:         data.writeStrongBinder(observer->asBinder());
    408:         if (remote()->transact(TRANSACTION_shutdown, data, &reply) != NO_ERROR) {
    409:             ALOGD("shutdown could not contact remote\n");
    410:             return;
    411:         }
    412:         int32_t err = reply.readExceptionCode();
    413:         if (err < 0) {
    ...

Grep finished (matches found) at Fri Jul 25 10:17:14
#+END_SRC

可见有一个interface里声明了这个函数的原型android.os.storage.IMountService.shutdown，然后有一个stub.proxy的实现：
android.os.storage.IMountService.Stub.Proxy.shutdown，但它的实现只是进行了binder的系统调用而已：

#+BEGIN_SRC java
            public void shutdown(IMountShutdownObserver observer)
                    throws RemoteException {
                Parcel _data = Parcel.obtain();
                Parcel _reply = Parcel.obtain();
                try {
                    _data.writeInterfaceToken(DESCRIPTOR);
                    _data.writeStrongBinder((observer != null ? observer.asBinder() : null));
                    mRemote.transact(Stub.TRANSACTION_shutdown, _data, _reply, 0);
                    _reply.readException();
                } finally {
                    _reply.recycle();
                    _data.recycle();
                }
            }
#+END_SRC

然后 android.os.storage.IMountService.Stub 实现了这个Interface，但 android.server.MountService 又扩展了这个 Stub:
#+BEGIN_SRC java
    public static abstract class Stub extends Binder implements IMountService {}
class MountService extends IMountService.Stub
        implements INativeDaemonConnectorCallbacks, Watchdog.Monitor {}
#+END_SRC

然后注意上面proxy里的实现，发了一个 TRANSACTION_shutdown 的transact，先搜一下 TRANSACTION_shutdown 吧：
#+BEGIN_SRC grepout
-*- mode: grep; default-directory: "~/system-config/doc/baohaojun/blog/2014/06/04/" -*-
Grep started at Fri Jul 25 10:27:07

beagrep -e "TRANSACTION_shutdown" -d ~/src/android
/home/bhj/src/android/frameworks/base/core/java/android/os/storage/IMountService.java:458:                    mRemote.transact(Stub.TRANSACTION_shutdown, _data, _reply, 0);
/home/bhj/src/android/frameworks/base/core/java/android/os/storage/IMountService.java:800:        static final int TRANSACTION_shutdown = IBinder.FIRST_CALL_TRANSACTION + 19;
/home/bhj/src/android/frameworks/base/core/java/android/os/storage/IMountService.java:1048:                case TRANSACTION_shutdown: {
/home/bhj/src/android/frameworks/base/libs/storage/IMountService.cpp:44:    TRANSACTION_shutdown,
/home/bhj/src/android/frameworks/base/libs/storage/IMountService.cpp:408:        if (remote()->transact(TRANSACTION_shutdown, data, &reply) != NO_ERROR) {

Grep finished (matches found) at Fri Jul 25 10:27:07
#+END_SRC

.cpp的那个我们就不看了，完全在拷贝.java这边的代码。当然也可能是.java在拷贝.cpp的。

处理的地方是在IMountService.java:1048:行，这个是Stub里定义的，也就是说
Stub只实现了针对每个 TRANSACTION_xxx 应该怎么调用由子类(MountService)
实现的函数，它自己是一个也没有实现过的。

再看一下Stub自己一共定义了多少个函数吧：
#+BEGIN_SRC grepout
-*- mode: grep; default-directory: "~/src/android/frameworks/base/core/java/android/os/storage/" -*-
Grep started at Fri Jul 25 14:44:33

grep-gtags -e "android.os.storage.IMountService.Stub..*" -t method |grep -v Proxy
Found total 42/38 definitions: Entering directory `/home/bhj/src/android'
frameworks/base/core/java/android/os/storage/IMountService.java:836: method: <android-os-storage-IMountService-Stub-asInterface> : public static IMountService asInterface(IBinder obj) {
frameworks/base/core/java/android/os/storage/IMountService.java:848: method: <android-os-storage-IMountService-Stub-Stub> : public Stub() {
frameworks/base/core/java/android/os/storage/IMountService.java:852: method: <android-os-storage-IMountService-Stub-asBinder> : public IBinder asBinder() {
frameworks/base/core/java/android/os/storage/IMountService.java:857: method: <android-os-storage-IMountService-Stub-onTransact> : public boolean onTransact(int code, Parcel data, Parcel reply, int flags) throws RemoteException {

Grep finished (matches found) at Fri Jul 25 14:44:36
#+END_SRC

其中asInterface的定义：
#+BEGIN_SRC java
        public static IMountService asInterface(IBinder obj) {
            if (obj == null) {
                return null;
            }
            IInterface iin = obj.queryLocalInterface(DESCRIPTOR);
            if (iin != null && iin instanceof IMountService) {
                return (IMountService) iin;
            }
            return new IMountService.Stub.Proxy(obj);
        }
#+END_SRC

会传进来一个obj，这个obj会被调到queryLocalInterface，最后调到的应该是：

#+BEGIN_SRC java
    public IInterface queryLocalInterface(String descriptor) {
        if (mDescriptor.equals(descriptor)) {
            return mOwner;
        }
        return null;
    }
#+END_SRC
这个在Binder.java里。mOwner被设值的地方：

#+BEGIN_SRC java
    public void attachInterface(IInterface owner, String descriptor) {
        mOwner = owner;
        mDescriptor = descriptor;
    }
#+END_SRC

attachInterface 是在MountService的Stub里调用的：

#+BEGIN_SRC grepout
-*- mode: grep; default-directory: "~/src/android/frameworks/base/core/java/android/os/storage/" -*-
Grep started at Sat Jul 26 22:04:08

grep-gtags -e "Stub" -d ~/src/android -o
Found total 2/8 definitions: Entering directory `/home/bhj/src/android'
frameworks/base/core/java/android/os/storage/IMountService.java:37: class: <android.os.storage.IMountService.Stub> : public static abstract class Stub extends Binder implements IMountService {
    37:     public static abstract class Stub extends Binder implements IMountService {
frameworks/base/core/java/android/os/storage/IMountService.java:830: method: <android.os.storage.IMountService.Stub.Stub> : public Stub() {
    830:         public Stub() {
    831:             attachInterface(this, DESCRIPTOR);
    832:         }
    833:

Grep finished (matches found) at Sat Jul 26 22:04:09
#+END_SRC

再看一下这个Stub的继承树：

#+BEGIN_SRC compout
-*- mode: compilation; default-directory: "~/src/android/frameworks/base/core/java/android/os/storage/" -*-
Compilation started at Sat Jul 26 22:06:28

ajoke-get-hierarchy.pl android.os.storage.IMountService.Stub -m Stub
make: Entering directory `/home/bhj/src/android'

=> class android.os.storage.IMountService.Stub at frameworks/base/core/java/android/os/storage/IMountService.java line 37.
      public Stub(){
   => class android.os.Binder at frameworks/base/core/java/android/os/Binder.java line 43.
      => interface android.os.IBinder at frameworks/base/core/java/android/os/IBinder.java line 86.
      => class java.lang.Object at libcore/luni/src/main/java/java/lang/Object.java line 131.
   => interface android.os.storage.IMountService at frameworks/base/core/java/android/os/storage/IMountService.java line 35.
         public static abstract class Stub extends Binder implements IMountService{
      => interface android.os.IInterface at frameworks/base/core/java/android/os/IInterface.java line 23.

Compilation finished at Sat Jul 26 22:06:30
#+END_SRC

这时候就非常清楚的可以看到了，C++里的RTTI（Run Time Type Infomation）
的一种机制，在这个java代码里用obj+descriptor的方式重新实现了一遍。为什
么不直接用isinstanceof呢？有点想不明白。可能是这些源码的作者想尽量保持
java与c++接口名字上的一致性？

回到IMountService，asInterface用到的地方：

#+BEGIN_SRC grepout
asIt-*- mode: grep; default-directory: "~/src/android/frameworks/base/core/java/android/os/storage/" -*-
Grep started at Fri Jul 25 14:53:30

grep-func-call -e "IMountService.*asInterface" --nc -a -v /tests/


Entering directory `/home/bhj/src/android/frameworks/base/core/java/android/app'
ContextImpl.java:2172: <=     private File[] ensureDirsExistOrFilter(File[] dirs) {
ContextImpl.java:2182: =>                         final IMountService mount = IMountService.Stub.asInterface(
Entering directory `/home/bhj/src/android/frameworks/base/core/java/android/os'
Environment.java:74: <=     private static StorageVolume getPrimaryVolume() {
Environment.java:83: =>                         IMountService mountService = IMountService.Stub.asInterface(ServiceManager
Environment.java:707: <=     public static String getStorageState(File path) {
Environment.java:717: =>             final IMountService mountService = IMountService.Stub.asInterface(
Entering directory `/home/bhj/src/android/frameworks/base/core/java/android/os/storage'
IMountService.java:836: <>         public static IMountService asInterface(IBinder obj) {
IMountService.java:857: <=         public boolean onTransact(int code, Parcel data, Parcel reply,
IMountService.java:867: =>                     listener = IMountServiceListener.Stub.asInterface(data.readStrongBinder());
IMountService.java:875: =>                     listener = IMountServiceListener.Stub.asInterface(data.readStrongBinder());
Entering directory `/home/bhj/src/android/frameworks/base/core/java/android/os/storage'
StorageManager.java:315: <=     public StorageManager(ContentResolver resolver, Looper tgtLooper) throws RemoteException {
StorageManager.java:318: =>         mMountService = IMountService.Stub.asInterface(ServiceManager.getService("mount"));
Entering directory `/home/bhj/src/android/frameworks/base/core/java/com/android/internal/content'
PackageHelper.java:61: <=     public static IMountService getMountService() throws RemoteException {
PackageHelper.java:64: =>             return IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/frameworks/base/core/java/com/android/internal/os/storage'
ExternalStorageFormatter.java:319: <=     IMountService getMountService() {
ExternalStorageFormatter.java:323: =>                 mMountService = IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/frameworks/base/core/java/com/android/internal/widget'
LockPatternUtils.java:632: <=     private void updateEncryptionPassword(String password) {
LockPatternUtils.java:645: =>         IMountService mountService = IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/frameworks/base/packages/BackupRestoreConfirmation/src/com/android/backupconfirm'
BackupRestoreConfirmation.java:131: <=     public void onCreate(Bundle icicle) {
BackupRestoreConfirmation.java:159: =>         mMountService = IMountService.Stub.asInterface(ServiceManager.getService("mount"));
Entering directory `/home/bhj/src/android/frameworks/base/packages/SystemUI/src/com/android/systemui/usb'
UsbStorageActivity.java:202: <=     private IMountService getMountService() {
UsbStorageActivity.java:205: =>             return IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/frameworks/base/services/java/com/android/server'
BackupManagerService.java:773: <=     public BackupManagerService(Context context) {
BackupManagerService.java:781: =>         mMountService = IMountService.Stub.asInterface(ServiceManager.getService("mount"));
Entering directory `/home/bhj/src/android/frameworks/base/services/java/com/android/server/power'
ShutdownThread.java:295: <=     public void run() {
ShutdownThread.java:374: =>                 final IMountService mount = IMountService.Stub.asInterface(
Entering directory `/home/bhj/src/android/packages/apps/SettingsSmartisan/src/com/android/settings'
CryptKeeperConfirm.java:41: <=         public void onCreate(Bundle savedInstanceState) {
CryptKeeperConfirm.java:72: =>                     IMountService mountService = IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/packages/apps/SettingsSmartisan/src/com/android/settings'
CryptKeeper.java:614: <=     private IMountService getMountService() {
CryptKeeper.java:617: =>             return IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/packages/apps/SettingsSmartisan/src/com/android/settings/deviceinfo'
Memory.java:214: <=     private synchronized IMountService getMountService() {
Memory.java:218: =>                mMountService = IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/packages/apps/Settings/src/com/android/settings'
CryptKeeperConfirm.java:41: <=         public void onCreate(Bundle savedInstanceState) {
CryptKeeperConfirm.java:72: =>                     IMountService mountService = IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/packages/apps/Settings/src/com/android/settings'
CryptKeeper.java:614: <=     private IMountService getMountService() {
CryptKeeper.java:617: =>             return IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/packages/apps/Settings/src/com/android/settings/deviceinfo'
Memory.java:203: <=     private synchronized IMountService getMountService() {
Memory.java:207: =>                mMountService = IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/packages/apps/SystemUISmartisan/src/com/smartisanos/systemui/usb'
UsbStorageActivity.java:204: <=     private IMountService getMountService() {
UsbStorageActivity.java:207: =>             return IMountService.Stub.asInterface(service);
Entering directory `/home/bhj/src/android/vendor/qcom/proprietary/QualcommSettings/src/com/qualcomm/qualcommsettings'
QualcommSettings.java:687: <=    private void updateUsbMassStorageStatus() {
QualcommSettings.java:689: =>         IMountService mountService = IMountService.Stub.asInterface(ServiceManager

Grep finished (matches found) at Fri Jul 25 14:53:31
#+END_SRC

