blog/2014/06/04/0-binder.html

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 接口、继承树</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Binder机制从最底层讲，只是数据的封装、传送、解析而已，所以它并不是只有
特定语言可以使用的，至少在Android系统里C/C++/Java都可以使用Binder。
</p>

<p>
但它最重要的优点之一，应该是它与面向对象编程之间比较友好的关系。我们就
先来看看Java里面是怎么使用Binder机制的。
</p>

<p>
题外话：我在用ajoke.el/beagrep/ctags/global等开源软件阅读源代码，以下
会有一些这些工具的运行结果。
</p>

<p>
以MountService.java为例，它有一个shutdown函数，我们看看它是哪个binder
的：
</p>

<div class="org-src-container">

<pre class="src src-compout">-*- mode: compilation; default-directory: "~/src/android/frameworks/base/services/java/com/android/server/" -*-
Compilation started at Sat Jun 21 21:24:30

ajoke-get-hierarchy.pl com.android.server.MountService -m shutdown
<span class="org-function-name">make</span>: Entering directory `<span class="org-function-name">/home/bhj/src/android</span>'

=&gt; class com.android.server.MountService<span class="org-underline"> at </span><span class="org-underline"><span class="org-compilation-error">frameworks/base/services/java/com/android/server/MountService.java</span></span><span class="org-underline"> line </span><span class="org-underline"><span class="org-compilation-line-number">103</span></span><span class="org-underline">.</span>
      public void shutdown(final IMountShutdownObserver observer){
   =&gt; class android.os.storage.IMountService.Stub<span class="org-underline"> at </span><span class="org-underline"><span class="org-compilation-error">frameworks/base/core/java/android/os/storage/IMountService.java</span></span><span class="org-underline"> line </span><span class="org-underline"><span class="org-compilation-line-number">37</span></span><span class="org-underline">.</span>
      =&gt; class android.os.Binder<span class="org-underline"> at </span><span class="org-underline"><span class="org-compilation-error">frameworks/base/core/java/android/os/Binder.java</span></span><span class="org-underline"> line </span><span class="org-underline"><span class="org-compilation-line-number">43</span></span><span class="org-underline">.</span>
         =&gt; interface android.os.IBinder<span class="org-underline"> at </span><span class="org-underline"><span class="org-compilation-error">frameworks/base/core/java/android/os/IBinder.java</span></span><span class="org-underline"> line </span><span class="org-underline"><span class="org-compilation-line-number">86</span></span><span class="org-underline">.</span>
         =&gt; class java.lang.Object<span class="org-underline"> at </span><span class="org-underline"><span class="org-compilation-error">libcore/luni/src/main/java/java/lang/Object.java</span></span><span class="org-underline"> line </span><span class="org-underline"><span class="org-compilation-line-number">131</span></span><span class="org-underline">.</span>
      =&gt; interface android.os.storage.IMountService<span class="org-underline"> at </span><span class="org-underline"><span class="org-compilation-error">frameworks/base/core/java/android/os/storage/IMountService.java</span></span><span class="org-underline"> line </span><span class="org-underline"><span class="org-compilation-line-number">35</span></span><span class="org-underline">.</span>
            public void shutdown(IMountShutdownObserver observer)throws RemoteException;
         =&gt; interface android.os.IInterface<span class="org-underline"> at </span><span class="org-underline"><span class="org-compilation-error">frameworks/base/core/java/android/os/IInterface.java</span></span><span class="org-underline"> line </span><span class="org-underline"><span class="org-compilation-line-number">23</span></span><span class="org-underline">.</span>
   =&gt; interface com.android.server.INativeDaemonConnectorCallbacks<span class="org-underline"> at </span><span class="org-underline"><span class="org-compilation-error">frameworks/base/services/java/com/android/server/INativeDaemonConnectorCallbacks.java</span></span><span class="org-underline"> line </span><span class="org-underline"><span class="org-compilation-line-number">20</span></span><span class="org-underline">.</span>
   =&gt; interface com.android.server.Watchdog.Monitor<span class="org-underline"> at </span><span class="org-underline"><span class="org-compilation-error">frameworks/base/services/java/com/android/server/Watchdog.java</span></span><span class="org-underline"> line </span><span class="org-underline"><span class="org-compilation-line-number">170</span></span><span class="org-underline">.</span>

Compilation <span class="org-compilation-info">finished</span> at Sat Jun 21 21:24:31
</pre>
</div>

<p>
哦，对了，你看到的上面这段代码就是它在我的Emacs编辑器里显示的样子，为
了让它正确的代码高亮，我还颇费了一番功夫呢！首先，上面的代码是
compilation-mode，这个在Emacs里是一种read-only的模式，然而org-html-fontify-code的代码是这样写的：
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq code (<span class="org-keyword">with-temp-buffer</span>
             <span class="org-comment-delimiter">;; </span><span class="org-comment">Switch to language-specific mode.</span>
             (funcall lang-mode)
             (insert code)
             <span class="org-comment-delimiter">;; </span><span class="org-comment">Fontify buffer.</span>
             (font-lock-fontify-buffer)
</pre>
</div>

<p>
可见，它先设置了mode <code>(funcall lang-mode)</code> 为compilation-mode，然后再
插入code <code>(insert code)</code> ，这就出问题了，compilation-mode是只读的，不
允许插入。为了绕过这个问题，我定义了一种新的compout-mode，很简单，就是可写的compilation-mode：
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">compout-mode</span> ()
  <span class="org-doc">"compilation mode, which is not buffer readonly for org export"</span>
  (interactive)
  (compilation-mode)
  (setq buffer-read-only nil))
</pre>
</div>

<p>
另外，做成这样之后，还是有问题，上面的代码输出到html之后没有全部高亮，
经查，应该是compilation-mode对temp-buffer有歧视，在temp-buffer里不会最
努力地高亮（见上面的 <code>with-temp-buffer</code> ）。
</p>

<p>
<code>with-temp-buffer</code> 的定义是这样的：
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defmacro</span> <span class="org-function-name">with-temp-buffer</span> (<span class="org-type">&amp;rest</span> body)
  <span class="org-doc">"Create a temporary buffer, and evaluate BODY there like `</span><span class="org-doc"><span class="org-constant">progn</span></span><span class="org-doc">'.</span>
<span class="org-doc">See also `</span><span class="org-doc"><span class="org-constant">with-temp-file</span></span><span class="org-doc">' and `</span><span class="org-doc"><span class="org-constant">with-output-to-string</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">declare</span> (indent 0) (debug t))
  (<span class="org-keyword">let</span> ((temp-buffer (make-symbol <span class="org-string">"temp-buffer"</span>)))
    `(<span class="org-keyword">let</span> ((,temp-buffer (generate-new-buffer <span class="org-string">" *temp*"</span>)))
       <span class="org-comment-delimiter">;; </span><span class="org-comment">FIXME: kill-buffer can change current-buffer in some odd cases.</span>
       (<span class="org-keyword">with-current-buffer</span> ,temp-buffer
         (<span class="org-keyword">unwind-protect</span>
             (<span class="org-keyword">progn</span> ,@body)
           (and (buffer-name ,temp-buffer)
                (kill-buffer ,temp-buffer)))))))
</pre>
</div>

<p>
问题出在 <code>(generate-new-buffer " *temp*")</code> 这个语句，buffer名字不能叫
<code>*temp*</code> ，所以我定义了一个advice来绕开这个问题：
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">org-html-fontify-code-compout</span> (orig-fun <span class="org-type">&amp;rest</span> args)
  <span class="org-doc">"Make compilation output htmlized."</span>
  (<span class="org-keyword">if</span> (string= (cadr args) <span class="org-string">"compout"</span>)
      (flet ((generate-new-buffer (name)
                                  (<span class="org-keyword">when</span> (string= name <span class="org-string">" *temp*"</span>)
                                    (setq name <span class="org-string">"temp-ox"</span>))
                                  (get-buffer-create (generate-new-buffer-name name))))
        (apply orig-fun args))
    (apply orig-fun args)))

(eval-after-load 'ox-html
  '(advice-add 'org-html-fontify-code <span class="org-builtin">:around</span> #'org-html-fontify-code-compout))
</pre>
</div>

<p>
当第二个参数 <code>(cadr args)</code> 为 "compout" 时，让generate-new-buffer的定
义发生变化，如果其参数名为 <code>*temp*</code> ，则改成 temp-ox 。
</p>

<p>
好了，从上面我用 ajoke-get-hierarchy 搞出来的继承树来看， shutdown 函数最早是在IMountService里定义的：
</p>

<div class="org-src-container">

<pre class="src src-compout">=&gt; interface android.os.storage.IMountService<span class="org-underline"> at </span><span class="org-underline"><span class="org-compilation-error">frameworks/base/core/java/android/os/storage/IMountService.java</span></span><span class="org-underline"> line </span><span class="org-underline"><span class="org-compilation-line-number">35</span></span><span class="org-underline">.</span>
      public void shutdown(IMountShutdownObserver observer)throws RemoteException;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-grepout">-*- mode: grep; default-directory: "~/src/android/frameworks/base/core/java/android/os/" -*-
Grep started at Fri Jul 25 10:02:01

grep-func-call -e "IMountService.*asInterface" --nc -a -v /tests/


Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/core/java/android/app</span>'
<span class="org-underline"><span class="org-compilation-info">ContextImpl.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">2172</span></span><span class="org-underline">:</span> &lt;=     private File[] ensureDirsExistOrFilter(File[] dirs) {
<span class="org-underline"><span class="org-compilation-info">ContextImpl.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">2182</span></span><span class="org-underline">:</span> =&gt;                         final IMountService mount = IMountService.Stub.asInterface(
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/core/java/android/os</span>'
<span class="org-underline"><span class="org-compilation-info">Environment.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">74</span></span><span class="org-underline">:</span> &lt;=     private static StorageVolume getPrimaryVolume() {
<span class="org-underline"><span class="org-compilation-info">Environment.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">83</span></span><span class="org-underline">:</span> =&gt;                         IMountService mountService = IMountService.Stub.asInterface(ServiceManager
<span class="org-underline"><span class="org-compilation-info">Environment.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">707</span></span><span class="org-underline">:</span> &lt;=     public static String getStorageState(File path) {
<span class="org-underline"><span class="org-compilation-info">Environment.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">717</span></span><span class="org-underline">:</span> =&gt;             final IMountService mountService = IMountService.Stub.asInterface(
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/core/java/android/os/storage</span>'
<span class="org-underline"><span class="org-compilation-info">IMountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">836</span></span><span class="org-underline">:</span> &lt;&gt;         public static IMountService asInterface(IBinder obj) {
<span class="org-underline"><span class="org-compilation-info">IMountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">857</span></span><span class="org-underline">:</span> &lt;=         public boolean onTransact(int code, Parcel data, Parcel reply,
<span class="org-underline"><span class="org-compilation-info">IMountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">867</span></span><span class="org-underline">:</span> =&gt;                     listener = IMountServiceListener.Stub.asInterface(data.readStrongBinder());
<span class="org-underline"><span class="org-compilation-info">IMountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">875</span></span><span class="org-underline">:</span> =&gt;                     listener = IMountServiceListener.Stub.asInterface(data.readStrongBinder());
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/core/java/android/os/storage</span>'
<span class="org-underline"><span class="org-compilation-info">StorageManager.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">315</span></span><span class="org-underline">:</span> &lt;=     public StorageManager(ContentResolver resolver, Looper tgtLooper) throws RemoteException {
<span class="org-underline"><span class="org-compilation-info">StorageManager.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">318</span></span><span class="org-underline">:</span> =&gt;         mMountService = IMountService.Stub.asInterface(ServiceManager.getService("mount"));
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/core/java/com/android/internal/content</span>'
<span class="org-underline"><span class="org-compilation-info">PackageHelper.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">61</span></span><span class="org-underline">:</span> &lt;=     public static IMountService getMountService() throws RemoteException {
<span class="org-underline"><span class="org-compilation-info">PackageHelper.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">64</span></span><span class="org-underline">:</span> =&gt;             return IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/core/java/com/android/internal/os/storage</span>'
<span class="org-underline"><span class="org-compilation-info">ExternalStorageFormatter.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">319</span></span><span class="org-underline">:</span> &lt;=     IMountService getMountService() {
<span class="org-underline"><span class="org-compilation-info">ExternalStorageFormatter.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">323</span></span><span class="org-underline">:</span> =&gt;                 mMountService = IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/core/java/com/android/internal/widget</span>'
<span class="org-underline"><span class="org-compilation-info">LockPatternUtils.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">632</span></span><span class="org-underline">:</span> &lt;=     private void updateEncryptionPassword(String password) {
<span class="org-underline"><span class="org-compilation-info">LockPatternUtils.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">645</span></span><span class="org-underline">:</span> =&gt;         IMountService mountService = IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/packages/BackupRestoreConfirmation/src/com/android/backupconfirm</span>'
<span class="org-underline"><span class="org-compilation-info">BackupRestoreConfirmation.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">131</span></span><span class="org-underline">:</span> &lt;=     public void onCreate(Bundle icicle) {
<span class="org-underline"><span class="org-compilation-info">BackupRestoreConfirmation.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">159</span></span><span class="org-underline">:</span> =&gt;         mMountService = IMountService.Stub.asInterface(ServiceManager.getService("mount"));
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/packages/SystemUI/src/com/android/systemui/usb</span>'
<span class="org-underline"><span class="org-compilation-info">UsbStorageActivity.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">202</span></span><span class="org-underline">:</span> &lt;=     private IMountService getMountService() {
<span class="org-underline"><span class="org-compilation-info">UsbStorageActivity.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">205</span></span><span class="org-underline">:</span> =&gt;             return IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/services/java/com/android/server</span>'
<span class="org-underline"><span class="org-compilation-info">BackupManagerService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">773</span></span><span class="org-underline">:</span> &lt;=     public BackupManagerService(Context context) {
<span class="org-underline"><span class="org-compilation-info">BackupManagerService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">781</span></span><span class="org-underline">:</span> =&gt;         mMountService = IMountService.Stub.asInterface(ServiceManager.getService("mount"));
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/services/java/com/android/server/power</span>'
<span class="org-underline"><span class="org-compilation-info">ShutdownThread.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">295</span></span><span class="org-underline">:</span> &lt;=     public void run() {
<span class="org-underline"><span class="org-compilation-info">ShutdownThread.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">374</span></span><span class="org-underline">:</span> =&gt;                 final IMountService mount = IMountService.Stub.asInterface(
Entering directory `<span class="org-function-name">/home/bhj/src/android/packages/apps/SettingsSmartisan/src/com/android/settings</span>'
<span class="org-underline"><span class="org-compilation-info">CryptKeeperConfirm.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">41</span></span><span class="org-underline">:</span> &lt;=         public void onCreate(Bundle savedInstanceState) {
<span class="org-underline"><span class="org-compilation-info">CryptKeeperConfirm.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">72</span></span><span class="org-underline">:</span> =&gt;                     IMountService mountService = IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/packages/apps/SettingsSmartisan/src/com/android/settings</span>'
<span class="org-underline"><span class="org-compilation-info">CryptKeeper.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">614</span></span><span class="org-underline">:</span> &lt;=     private IMountService getMountService() {
<span class="org-underline"><span class="org-compilation-info">CryptKeeper.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">617</span></span><span class="org-underline">:</span> =&gt;             return IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/packages/apps/SettingsSmartisan/src/com/android/settings/deviceinfo</span>'
<span class="org-underline"><span class="org-compilation-info">Memory.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">214</span></span><span class="org-underline">:</span> &lt;=     private synchronized IMountService getMountService() {
<span class="org-underline"><span class="org-compilation-info">Memory.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">218</span></span><span class="org-underline">:</span> =&gt;                mMountService = IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/packages/apps/Settings/src/com/android/settings</span>'
<span class="org-underline"><span class="org-compilation-info">CryptKeeperConfirm.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">41</span></span><span class="org-underline">:</span> &lt;=         public void onCreate(Bundle savedInstanceState) {
<span class="org-underline"><span class="org-compilation-info">CryptKeeperConfirm.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">72</span></span><span class="org-underline">:</span> =&gt;                     IMountService mountService = IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/packages/apps/Settings/src/com/android/settings</span>'
<span class="org-underline"><span class="org-compilation-info">CryptKeeper.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">614</span></span><span class="org-underline">:</span> &lt;=     private IMountService getMountService() {
<span class="org-underline"><span class="org-compilation-info">CryptKeeper.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">617</span></span><span class="org-underline">:</span> =&gt;             return IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/packages/apps/Settings/src/com/android/settings/deviceinfo</span>'
<span class="org-underline"><span class="org-compilation-info">Memory.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">203</span></span><span class="org-underline">:</span> &lt;=     private synchronized IMountService getMountService() {
<span class="org-underline"><span class="org-compilation-info">Memory.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">207</span></span><span class="org-underline">:</span> =&gt;                mMountService = IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/packages/apps/SystemUISmartisan/src/com/smartisanos/systemui/usb</span>'
<span class="org-underline"><span class="org-compilation-info">UsbStorageActivity.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">204</span></span><span class="org-underline">:</span> &lt;=     private IMountService getMountService() {
<span class="org-underline"><span class="org-compilation-info">UsbStorageActivity.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">207</span></span><span class="org-underline">:</span> =&gt;             return IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/vendor/qcom/proprietary/QualcommSettings/src/com/qualcomm/qualcommsettings</span>'
<span class="org-underline"><span class="org-compilation-info">QualcommSettings.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">687</span></span><span class="org-underline">:</span> &lt;=    private void updateUsbMassStorageStatus() {
<span class="org-underline"><span class="org-compilation-info">QualcommSettings.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">689</span></span><span class="org-underline">:</span> =&gt;         IMountService mountService = IMountService.Stub.asInterface(ServiceManager

Grep finished (<span class="org-compilation-info">matches found</span>) at Fri Jul 25 10:02:02
</pre>
</div>

<p>
啊，还是看一看shutdown在I?MountService里都有谁定义的：
</p>

<div class="org-src-container">

<pre class="src src-grepout">-*- mode: grep; default-directory: "~/src/android/frameworks/base/core/java/android/os/storage/" -*-
Grep started at Fri Jul 25 10:17:13

grep-gtags -e "shutdown" -p MountServ
Found total 4/1728 definitions: Entering directory `<span class="org-function-name">/home/bhj/src/android</span>'
<span class="org-underline"><span class="org-compilation-info">frameworks/base/core/java/android/os/storage/IMountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">451</span></span><span class="org-underline">:</span> method: &lt;android.os.storage.IMountService.Stub.Proxy.shutdown&gt; : public void shutdown(IMountShutdownObserver observer) throws RemoteException {
<span class="org-underline"><span class="org-compilation-info">frameworks/base/core/java/android/os/storage/IMountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">1310</span></span><span class="org-underline">:</span> method: &lt;android.os.storage.IMountService.shutdown&gt; : public void shutdown(IMountShutdownObserver observer) throws RemoteException;
<span class="org-underline"><span class="org-compilation-info">frameworks/base/services/java/com/android/server/MountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">1423</span></span><span class="org-underline">:</span> method: &lt;com.android.server.MountService.shutdown&gt; : public void shutdown(final IMountShutdownObserver observer) {
<span class="org-underline"><span class="org-compilation-info">frameworks/base/libs/storage/IMountService.cpp</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">403</span></span><span class="org-underline">:</span> function: &lt;android::BpMountService::shutdown&gt; : void shutdown(const sp&lt;IMountShutdownObserver&gt;&amp; observer) {
    403:     void shutdown(const sp&lt;IMountShutdownObserver&gt;&amp; observer)
    404:     {
    405:         Parcel data, reply;
    406:         data.writeInterfaceToken(IMountService::getInterfaceDescriptor());
    407:         data.writeStrongBinder(observer-&gt;asBinder());
    408:         if (remote()-&gt;transact(TRANSACTION_shutdown, data, &amp;reply) != NO_ERROR) {
    409:             ALOGD("shutdown could not contact remote\n");
    410:             return;
    411:         }
    412:         int32_t err = reply.readExceptionCode();
    413:         if (err &lt; 0) {
    ...

Grep finished (<span class="org-compilation-info">matches found</span>) at Fri Jul 25 10:17:14
</pre>
</div>

<p>
可见有一个interface里声明了这个函数的原型android.os.storage.IMountService.shutdown，然后有一个stub.proxy的实现：
android.os.storage.IMountService.Stub.Proxy.shutdown，但它的实现只是进行了binder的系统调用而已：
</p>

<div class="org-src-container">

<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">shutdown</span>(<span class="org-type">IMountShutdownObserver</span> <span class="org-variable-name">observer</span>)
        <span class="org-keyword">throws</span> <span class="org-type">RemoteException</span> {
    <span class="org-type">Parcel</span> <span class="org-variable-name">_data</span> = Parcel.obtain();
    <span class="org-type">Parcel</span> <span class="org-variable-name">_reply</span> = Parcel.obtain();
    <span class="org-keyword">try</span> {
        _data.writeInterfaceToken(DESCRIPTOR);
        _data.writeStrongBinder((observer != <span class="org-constant">null</span> ? observer.asBinder() : <span class="org-constant">null</span>));
        mRemote.transact(<span class="org-constant">Stub</span>.TRANSACTION_shutdown, _data, _reply, 0);
        _reply.readException();
    } <span class="org-keyword">finally</span> {
        _reply.recycle();
        _data.recycle();
    }
}
</pre>
</div>

<p>
然后 android.os.storage.IMountService.Stub 实现了这个Interface，但 android.server.MountService 又扩展了这个 Stub:
</p>
<div class="org-src-container">

<pre class="src src-java">    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-keyword">abstract</span> <span class="org-keyword">class</span> <span class="org-type">Stub</span> <span class="org-keyword">extends</span> <span class="org-type">Binder</span> <span class="org-keyword">implements</span> <span class="org-type">IMountService</span> {}
<span class="org-keyword">class</span> <span class="org-type">MountService</span> <span class="org-keyword">extends</span> <span class="org-constant">IMountService</span>.<span class="org-type">Stub</span>
        <span class="org-keyword">implements</span> <span class="org-type">INativeDaemonConnectorCallbacks</span>, <span class="org-constant">Watchdog</span>.<span class="org-type">Monitor</span> {}
</pre>
</div>

<p>
然后注意上面proxy里的实现，发了一个 TRANSACTION_shutdown 的transact，先搜一下 TRANSACTION_shutdown 吧：
</p>
<div class="org-src-container">

<pre class="src src-grepout">-*- mode: grep; default-directory: "~/system-config/doc/baohaojun/blog/2014/06/04/" -*-
Grep started at Fri Jul 25 10:27:07

beagrep -e "TRANSACTION_shutdown" -d ~/src/android
<span class="org-underline"><span class="org-compilation-info">/home/bhj/src/android/frameworks/base/core/java/android/os/storage/IMountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">458</span></span><span class="org-underline">:</span>                    mRemote.transact(Stub.TRANSACTION_shutdown, _data, _reply, 0);
<span class="org-underline"><span class="org-compilation-info">/home/bhj/src/android/frameworks/base/core/java/android/os/storage/IMountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">800</span></span><span class="org-underline">:</span>        static final int TRANSACTION_shutdown = IBinder.FIRST_CALL_TRANSACTION + 19;
<span class="org-underline"><span class="org-compilation-info">/home/bhj/src/android/frameworks/base/core/java/android/os/storage/IMountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">1048</span></span><span class="org-underline">:</span>                case TRANSACTION_shutdown: {
<span class="org-underline"><span class="org-compilation-info">/home/bhj/src/android/frameworks/base/libs/storage/IMountService.cpp</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">44</span></span><span class="org-underline">:</span>    TRANSACTION_shutdown,
<span class="org-underline"><span class="org-compilation-info">/home/bhj/src/android/frameworks/base/libs/storage/IMountService.cpp</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">408</span></span><span class="org-underline">:</span>        if (remote()-&gt;transact(TRANSACTION_shutdown, data, &amp;reply) != NO_ERROR) {

Grep finished (<span class="org-compilation-info">matches found</span>) at Fri Jul 25 10:27:07
</pre>
</div>

<p>
.cpp的那个我们就不看了，完全在拷贝.java这边的代码。当然也可能是.java在拷贝.cpp的。
</p>

<p>
处理的地方是在IMountService.java:1048:行，这个是Stub里定义的，也就是说
Stub只实现了针对每个 TRANSACTION_xxx 应该怎么调用由子类(MountService)
实现的函数，它自己是一个也没有实现过的。
</p>

<p>
再看一下Stub自己一共定义了多少个函数吧：
</p>
<div class="org-src-container">

<pre class="src src-grepout">-*- mode: grep; default-directory: "~/src/android/frameworks/base/core/java/android/os/storage/" -*-
Grep started at Fri Jul 25 14:44:33

grep-gtags -e "android.os.storage.IMountService.Stub..*" -t method |grep -v Proxy
Found total 42/38 definitions: Entering directory `<span class="org-function-name">/home/bhj/src/android</span>'
<span class="org-underline"><span class="org-compilation-info">frameworks/base/core/java/android/os/storage/IMountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">836</span></span><span class="org-underline">:</span> method: &lt;android-os-storage-IMountService-Stub-asInterface&gt; : public static IMountService asInterface(IBinder obj) {
<span class="org-underline"><span class="org-compilation-info">frameworks/base/core/java/android/os/storage/IMountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">848</span></span><span class="org-underline">:</span> method: &lt;android-os-storage-IMountService-Stub-Stub&gt; : public Stub() {
<span class="org-underline"><span class="org-compilation-info">frameworks/base/core/java/android/os/storage/IMountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">852</span></span><span class="org-underline">:</span> method: &lt;android-os-storage-IMountService-Stub-asBinder&gt; : public IBinder asBinder() {
<span class="org-underline"><span class="org-compilation-info">frameworks/base/core/java/android/os/storage/IMountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">857</span></span><span class="org-underline">:</span> method: &lt;android-os-storage-IMountService-Stub-onTransact&gt; : public boolean onTransact(int code, Parcel data, Parcel reply, int flags) throws RemoteException {

Grep finished (<span class="org-compilation-info">matches found</span>) at Fri Jul 25 14:44:36
</pre>
</div>

<p>
其中asInterface的定义：
</p>
<div class="org-src-container">

<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">IMountService</span> <span class="org-function-name">asInterface</span>(<span class="org-type">IBinder</span> <span class="org-variable-name">obj</span>) {
    <span class="org-keyword">if</span> (obj == <span class="org-constant">null</span>) {
        <span class="org-keyword">return</span> <span class="org-constant">null</span>;
    }
    <span class="org-type">IInterface</span> <span class="org-variable-name">iin</span> = obj.queryLocalInterface(DESCRIPTOR);
    <span class="org-keyword">if</span> (iin != <span class="org-constant">null</span> &amp;&amp; iin <span class="org-keyword">instanceof</span> IMountService) {
        <span class="org-keyword">return</span> (<span class="org-type">IMountService</span>) iin;
    }
    <span class="org-keyword">return</span> <span class="org-keyword">new</span> <span class="org-constant">IMountService</span>.<span class="org-constant">Stub</span>.<span class="org-type">Proxy</span>(obj);
}
</pre>
</div>

<p>
会传进来一个obj，这个obj会被调到queryLocalInterface，最后调到的应该是：
</p>

<div class="org-src-container">

<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-type">IInterface</span> <span class="org-function-name">queryLocalInterface</span>(<span class="org-type">String</span> <span class="org-variable-name">descriptor</span>) {
    <span class="org-keyword">if</span> (mDescriptor.equals(descriptor)) {
        <span class="org-keyword">return</span> mOwner;
    }
    <span class="org-keyword">return</span> <span class="org-constant">null</span>;
}
</pre>
</div>
<p>
这个在Binder.java里。mOwner被设值的地方：
</p>

<div class="org-src-container">

<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">attachInterface</span>(<span class="org-type">IInterface</span> <span class="org-variable-name">owner</span>, <span class="org-type">String</span> <span class="org-variable-name">descriptor</span>) {
    mOwner = owner;
    mDescriptor = descriptor;
}
</pre>
</div>

<p>
attachInterface 是在MountService的Stub里调用的：
</p>

<div class="org-src-container">

<pre class="src src-grepout">-*- mode: grep; default-directory: "~/src/android/frameworks/base/core/java/android/os/storage/" -*-
Grep started at Sat Jul 26 22:04:08

grep-gtags -e "Stub" -d ~/src/android -o
Found total 2/8 definitions: Entering directory `<span class="org-function-name">/home/bhj/src/android</span>'
<span class="org-underline"><span class="org-compilation-info">frameworks/base/core/java/android/os/storage/IMountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">37</span></span><span class="org-underline">:</span> class: &lt;android.os.storage.IMountService.Stub&gt; : public static abstract class Stub extends Binder implements IMountService {
    37:     public static abstract class Stub extends Binder implements IMountService {
<span class="org-underline"><span class="org-compilation-info">frameworks/base/core/java/android/os/storage/IMountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">830</span></span><span class="org-underline">:</span> method: &lt;android.os.storage.IMountService.Stub.Stub&gt; : public Stub() {
    830:         public Stub() {
    831:             attachInterface(this, DESCRIPTOR);
    832:         }
    833:

Grep finished (<span class="org-compilation-info">matches found</span>) at Sat Jul 26 22:04:09
</pre>
</div>

<p>
再看一下这个Stub的继承树：
</p>

<div class="org-src-container">

<pre class="src src-compout">-*- mode: compilation; default-directory: "~/src/android/frameworks/base/core/java/android/os/storage/" -*-
Compilation started at Sat Jul 26 22:06:28

ajoke-get-hierarchy.pl android.os.storage.IMountService.Stub -m Stub
<span class="org-function-name">make</span>: Entering directory `<span class="org-function-name">/home/bhj/src/android</span>'

=&gt; class android.os.storage.IMountService.Stub<span class="org-underline"> at </span><span class="org-underline"><span class="org-compilation-error">frameworks/base/core/java/android/os/storage/IMountService.java</span></span><span class="org-underline"> line </span><span class="org-underline"><span class="org-compilation-line-number">37</span></span><span class="org-underline">.</span>
      public Stub(){
   =&gt; class android.os.Binder<span class="org-underline"> at </span><span class="org-underline"><span class="org-compilation-error">frameworks/base/core/java/android/os/Binder.java</span></span><span class="org-underline"> line </span><span class="org-underline"><span class="org-compilation-line-number">43</span></span><span class="org-underline">.</span>
      =&gt; interface android.os.IBinder<span class="org-underline"> at </span><span class="org-underline"><span class="org-compilation-error">frameworks/base/core/java/android/os/IBinder.java</span></span><span class="org-underline"> line </span><span class="org-underline"><span class="org-compilation-line-number">86</span></span><span class="org-underline">.</span>
      =&gt; class java.lang.Object<span class="org-underline"> at </span><span class="org-underline"><span class="org-compilation-error">libcore/luni/src/main/java/java/lang/Object.java</span></span><span class="org-underline"> line </span><span class="org-underline"><span class="org-compilation-line-number">131</span></span><span class="org-underline">.</span>
   =&gt; interface android.os.storage.IMountService<span class="org-underline"> at </span><span class="org-underline"><span class="org-compilation-error">frameworks/base/core/java/android/os/storage/IMountService.java</span></span><span class="org-underline"> line </span><span class="org-underline"><span class="org-compilation-line-number">35</span></span><span class="org-underline">.</span>
         public static abstract class Stub extends Binder implements IMountService{
      =&gt; interface android.os.IInterface<span class="org-underline"> at </span><span class="org-underline"><span class="org-compilation-error">frameworks/base/core/java/android/os/IInterface.java</span></span><span class="org-underline"> line </span><span class="org-underline"><span class="org-compilation-line-number">23</span></span><span class="org-underline">.</span>

Compilation <span class="org-compilation-info">finished</span> at Sat Jul 26 22:06:30
</pre>
</div>

<p>
这时候就非常清楚的可以看到了，C++里的RTTI（Run Time Type Infomation）
的一种机制，在这个java代码里用obj+descriptor的方式重新实现了一遍。为什
么不直接用isinstanceof呢？有点想不明白。可能是这些源码的作者想尽量保持
java与c++接口名字上的一致性？
</p>

<p>
回到IMountService，asInterface用到的地方：
</p>

<div class="org-src-container">

<pre class="src src-grepout">asIt-*- mode: grep; default-directory: "~/src/android/frameworks/base/core/java/android/os/storage/" -*-
Grep started at Fri Jul 25 14:53:30

grep-func-call -e "IMountService.*asInterface" --nc -a -v /tests/


Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/core/java/android/app</span>'
<span class="org-underline"><span class="org-compilation-info">ContextImpl.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">2172</span></span><span class="org-underline">:</span> &lt;=     private File[] ensureDirsExistOrFilter(File[] dirs) {
<span class="org-underline"><span class="org-compilation-info">ContextImpl.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">2182</span></span><span class="org-underline">:</span> =&gt;                         final IMountService mount = IMountService.Stub.asInterface(
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/core/java/android/os</span>'
<span class="org-underline"><span class="org-compilation-info">Environment.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">74</span></span><span class="org-underline">:</span> &lt;=     private static StorageVolume getPrimaryVolume() {
<span class="org-underline"><span class="org-compilation-info">Environment.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">83</span></span><span class="org-underline">:</span> =&gt;                         IMountService mountService = IMountService.Stub.asInterface(ServiceManager
<span class="org-underline"><span class="org-compilation-info">Environment.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">707</span></span><span class="org-underline">:</span> &lt;=     public static String getStorageState(File path) {
<span class="org-underline"><span class="org-compilation-info">Environment.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">717</span></span><span class="org-underline">:</span> =&gt;             final IMountService mountService = IMountService.Stub.asInterface(
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/core/java/android/os/storage</span>'
<span class="org-underline"><span class="org-compilation-info">IMountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">836</span></span><span class="org-underline">:</span> &lt;&gt;         public static IMountService asInterface(IBinder obj) {
<span class="org-underline"><span class="org-compilation-info">IMountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">857</span></span><span class="org-underline">:</span> &lt;=         public boolean onTransact(int code, Parcel data, Parcel reply,
<span class="org-underline"><span class="org-compilation-info">IMountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">867</span></span><span class="org-underline">:</span> =&gt;                     listener = IMountServiceListener.Stub.asInterface(data.readStrongBinder());
<span class="org-underline"><span class="org-compilation-info">IMountService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">875</span></span><span class="org-underline">:</span> =&gt;                     listener = IMountServiceListener.Stub.asInterface(data.readStrongBinder());
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/core/java/android/os/storage</span>'
<span class="org-underline"><span class="org-compilation-info">StorageManager.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">315</span></span><span class="org-underline">:</span> &lt;=     public StorageManager(ContentResolver resolver, Looper tgtLooper) throws RemoteException {
<span class="org-underline"><span class="org-compilation-info">StorageManager.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">318</span></span><span class="org-underline">:</span> =&gt;         mMountService = IMountService.Stub.asInterface(ServiceManager.getService("mount"));
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/core/java/com/android/internal/content</span>'
<span class="org-underline"><span class="org-compilation-info">PackageHelper.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">61</span></span><span class="org-underline">:</span> &lt;=     public static IMountService getMountService() throws RemoteException {
<span class="org-underline"><span class="org-compilation-info">PackageHelper.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">64</span></span><span class="org-underline">:</span> =&gt;             return IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/core/java/com/android/internal/os/storage</span>'
<span class="org-underline"><span class="org-compilation-info">ExternalStorageFormatter.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">319</span></span><span class="org-underline">:</span> &lt;=     IMountService getMountService() {
<span class="org-underline"><span class="org-compilation-info">ExternalStorageFormatter.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">323</span></span><span class="org-underline">:</span> =&gt;                 mMountService = IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/core/java/com/android/internal/widget</span>'
<span class="org-underline"><span class="org-compilation-info">LockPatternUtils.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">632</span></span><span class="org-underline">:</span> &lt;=     private void updateEncryptionPassword(String password) {
<span class="org-underline"><span class="org-compilation-info">LockPatternUtils.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">645</span></span><span class="org-underline">:</span> =&gt;         IMountService mountService = IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/packages/BackupRestoreConfirmation/src/com/android/backupconfirm</span>'
<span class="org-underline"><span class="org-compilation-info">BackupRestoreConfirmation.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">131</span></span><span class="org-underline">:</span> &lt;=     public void onCreate(Bundle icicle) {
<span class="org-underline"><span class="org-compilation-info">BackupRestoreConfirmation.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">159</span></span><span class="org-underline">:</span> =&gt;         mMountService = IMountService.Stub.asInterface(ServiceManager.getService("mount"));
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/packages/SystemUI/src/com/android/systemui/usb</span>'
<span class="org-underline"><span class="org-compilation-info">UsbStorageActivity.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">202</span></span><span class="org-underline">:</span> &lt;=     private IMountService getMountService() {
<span class="org-underline"><span class="org-compilation-info">UsbStorageActivity.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">205</span></span><span class="org-underline">:</span> =&gt;             return IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/services/java/com/android/server</span>'
<span class="org-underline"><span class="org-compilation-info">BackupManagerService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">773</span></span><span class="org-underline">:</span> &lt;=     public BackupManagerService(Context context) {
<span class="org-underline"><span class="org-compilation-info">BackupManagerService.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">781</span></span><span class="org-underline">:</span> =&gt;         mMountService = IMountService.Stub.asInterface(ServiceManager.getService("mount"));
Entering directory `<span class="org-function-name">/home/bhj/src/android/frameworks/base/services/java/com/android/server/power</span>'
<span class="org-underline"><span class="org-compilation-info">ShutdownThread.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">295</span></span><span class="org-underline">:</span> &lt;=     public void run() {
<span class="org-underline"><span class="org-compilation-info">ShutdownThread.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">374</span></span><span class="org-underline">:</span> =&gt;                 final IMountService mount = IMountService.Stub.asInterface(
Entering directory `<span class="org-function-name">/home/bhj/src/android/packages/apps/SettingsSmartisan/src/com/android/settings</span>'
<span class="org-underline"><span class="org-compilation-info">CryptKeeperConfirm.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">41</span></span><span class="org-underline">:</span> &lt;=         public void onCreate(Bundle savedInstanceState) {
<span class="org-underline"><span class="org-compilation-info">CryptKeeperConfirm.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">72</span></span><span class="org-underline">:</span> =&gt;                     IMountService mountService = IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/packages/apps/SettingsSmartisan/src/com/android/settings</span>'
<span class="org-underline"><span class="org-compilation-info">CryptKeeper.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">614</span></span><span class="org-underline">:</span> &lt;=     private IMountService getMountService() {
<span class="org-underline"><span class="org-compilation-info">CryptKeeper.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">617</span></span><span class="org-underline">:</span> =&gt;             return IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/packages/apps/SettingsSmartisan/src/com/android/settings/deviceinfo</span>'
<span class="org-underline"><span class="org-compilation-info">Memory.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">214</span></span><span class="org-underline">:</span> &lt;=     private synchronized IMountService getMountService() {
<span class="org-underline"><span class="org-compilation-info">Memory.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">218</span></span><span class="org-underline">:</span> =&gt;                mMountService = IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/packages/apps/Settings/src/com/android/settings</span>'
<span class="org-underline"><span class="org-compilation-info">CryptKeeperConfirm.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">41</span></span><span class="org-underline">:</span> &lt;=         public void onCreate(Bundle savedInstanceState) {
<span class="org-underline"><span class="org-compilation-info">CryptKeeperConfirm.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">72</span></span><span class="org-underline">:</span> =&gt;                     IMountService mountService = IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/packages/apps/Settings/src/com/android/settings</span>'
<span class="org-underline"><span class="org-compilation-info">CryptKeeper.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">614</span></span><span class="org-underline">:</span> &lt;=     private IMountService getMountService() {
<span class="org-underline"><span class="org-compilation-info">CryptKeeper.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">617</span></span><span class="org-underline">:</span> =&gt;             return IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/packages/apps/Settings/src/com/android/settings/deviceinfo</span>'
<span class="org-underline"><span class="org-compilation-info">Memory.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">203</span></span><span class="org-underline">:</span> &lt;=     private synchronized IMountService getMountService() {
<span class="org-underline"><span class="org-compilation-info">Memory.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">207</span></span><span class="org-underline">:</span> =&gt;                mMountService = IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/packages/apps/SystemUISmartisan/src/com/smartisanos/systemui/usb</span>'
<span class="org-underline"><span class="org-compilation-info">UsbStorageActivity.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">204</span></span><span class="org-underline">:</span> &lt;=     private IMountService getMountService() {
<span class="org-underline"><span class="org-compilation-info">UsbStorageActivity.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">207</span></span><span class="org-underline">:</span> =&gt;             return IMountService.Stub.asInterface(service);
Entering directory `<span class="org-function-name">/home/bhj/src/android/vendor/qcom/proprietary/QualcommSettings/src/com/qualcomm/qualcommsettings</span>'
<span class="org-underline"><span class="org-compilation-info">QualcommSettings.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">687</span></span><span class="org-underline">:</span> &lt;=    private void updateUsbMassStorageStatus() {
<span class="org-underline"><span class="org-compilation-info">QualcommSettings.java</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">689</span></span><span class="org-underline">:</span> =&gt;         IMountService mountService = IMountService.Stub.asInterface(ServiceManager

Grep finished (<span class="org-compilation-info">matches found</span>) at Fri Jul 25 14:53:31
</pre>
</div>
</div>
</div>
</div>
