blog/2014/06/04/0-binder.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> ServiceManager.getService()</h2>
<div class="outline-text-2" id="text-2">
<p>
这个函数：
</p>

<div class="org-src-container">

<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">IBinder</span> <span class="org-function-name">getService</span>(<span class="org-type">String</span> <span class="org-variable-name">name</span>) {
    <span class="org-keyword">try</span> {
        <span class="org-type">IBinder</span> <span class="org-variable-name">service</span> = sCache.get(name);
        <span class="org-keyword">if</span> (service != <span class="org-constant">null</span>) {
            <span class="org-keyword">return</span> service;
        } <span class="org-keyword">else</span> {
            <span class="org-keyword">return</span> getIServiceManager().getService(name);
        }
    } <span class="org-keyword">catch</span> (<span class="org-type">RemoteException</span> <span class="org-variable-name">e</span>) {
        Log.e(TAG, <span class="org-string">"error in getService"</span>, e);
    }
    <span class="org-keyword">return</span> <span class="org-constant">null</span>;
}
</pre>
</div>


<p>
会调到 getIServiceManager：
</p>

<div class="org-src-container">

<pre class="src src-java"><span class="org-keyword">private</span> <span class="org-keyword">static</span> <span class="org-type">IServiceManager</span> <span class="org-function-name">getIServiceManager</span>() {
    <span class="org-keyword">if</span> (sServiceManager != <span class="org-constant">null</span>) {
        <span class="org-keyword">return</span> sServiceManager;
    }

    <span class="org-comment-delimiter">// </span><span class="org-comment">Find the service manager</span>
    sServiceManager = ServiceManagerNative.asInterface(BinderInternal.getContextObject());
    <span class="org-keyword">return</span> sServiceManager;
}
</pre>
</div>

<p>
会调到 ServiceManagerNative.asInterface(BinderInternal.getContextObject())
</p>

<p>
其中 BinderInternal.getContextObject() 是个native的函数，它会调到 c++ 的 getContextObject：
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">sp</span>&lt;IBinder&gt; <span class="org-constant">ProcessState</span>::<span class="org-function-name">getContextObject</span>(<span class="org-keyword">const</span> <span class="org-type">sp</span>&lt;IBinder&gt;&amp; <span class="org-variable-name">caller</span>)
{
    <span class="org-keyword">return</span> getStrongProxyForHandle(0);
}
</pre>
</div>

<p>
可以看到，这里的caller参数都没有用到，不知道是为什么要有这个caller参数。
</p>

<p>
getStrongProxyForHandle的定义如下：
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">sp</span>&lt;IBinder&gt; <span class="org-constant">ProcessState</span>::<span class="org-function-name">getStrongProxyForHandle</span>(<span class="org-type">int32_t</span> <span class="org-variable-name">handle</span>)
{
    <span class="org-type">sp</span>&lt;IBinder&gt; <span class="org-variable-name">result</span>;

    <span class="org-type">AutoMutex</span> <span class="org-variable-name">_l</span>(mLock);

    <span class="org-type">handle_entry</span>* <span class="org-variable-name">e</span> = lookupHandleLocked(handle);

    <span class="org-keyword">if</span> (e != <span class="org-constant">NULL</span>) {
        <span class="org-comment-delimiter">// </span><span class="org-comment">We need to create a new BpBinder if there isn't currently one, OR we</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">are unable to acquire a weak reference on this current one.  See comment</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">in getWeakProxyForHandle() for more info about this.</span>
        <span class="org-type">IBinder</span>* <span class="org-variable-name">b</span> = e-&gt;binder;
        <span class="org-keyword">if</span> (b == <span class="org-constant">NULL</span> || <span class="org-negation-char">!</span>e-&gt;refs-&gt;attemptIncWeak(<span class="org-keyword">this</span>)) {
            b = <span class="org-keyword">new</span> <span class="org-type">BpBinder</span>(handle);
            e-&gt;binder = b;
            <span class="org-keyword">if</span> (b) e-&gt;refs = b-&gt;getWeakRefs();
            result = b;
        } <span class="org-keyword">else</span> {
            <span class="org-comment-delimiter">// </span><span class="org-comment">This little bit of nastyness is to allow us to add a primary</span>
            <span class="org-comment-delimiter">// </span><span class="org-comment">reference to the remote proxy when this team doesn't have one</span>
            <span class="org-comment-delimiter">// </span><span class="org-comment">but another team is sending the handle to us.</span>
            result.force_set(b);
            e-&gt;refs-&gt;decWeak(<span class="org-keyword">this</span>);
        }
    }

    <span class="org-keyword">return</span> result;
}
</pre>
</div>

<p>
所以这里我们要看一下 lookupHandleLocked 这个函数，此处传进去的handle为0。
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-constant">ProcessState</span>::<span class="org-type">handle_entry</span>* <span class="org-constant">ProcessState</span>::<span class="org-function-name">lookupHandleLocked</span>(<span class="org-type">int32_t</span> <span class="org-variable-name">handle</span>)
{
    <span class="org-keyword">const</span> <span class="org-type">size_t</span> <span class="org-variable-name">N</span>=mHandleToObject.size();
    <span class="org-keyword">if</span> (N &lt;= (<span class="org-type">size_t</span>)handle) {
        <span class="org-type">handle_entry</span> <span class="org-variable-name">e</span>;
        e.binder = <span class="org-constant">NULL</span>;
        e.refs = <span class="org-constant">NULL</span>;
        <span class="org-type">status_t</span> <span class="org-variable-name">err</span> = mHandleToObject.insertAt(e, N, handle+1-N);
        <span class="org-keyword">if</span> (err &lt; NO_ERROR) <span class="org-keyword">return</span> <span class="org-constant">NULL</span>;
    }
    <span class="org-keyword">return</span> &amp;mHandleToObject.editItemAt(handle);
}
</pre>
</div>

<p>
因为handle为0，所以 mHandleToObject 的.size() 和 handle 一比，如果
handle 不在 mHandleToObject 里，就需要插一个新的 handle_entry 进去，否
则直接从 mHandleToObject 里抽一个 editItemAt 出来交差。
</p>

<p>
看一下 mHandleToObject 是怎么初始化的：
</p>

<div class="org-src-container">

<pre class="src src-grepout">-*- mode: grep; default-directory: "~/src/android/frameworks/native/libs/binder/" -*-
Grep started at Sun Jul 27 22:16:08

beagrep -e "mHandleToObject"
<span class="org-underline"><span class="org-compilation-info">/home/bhj/src/android/frameworks/native/include/binder/ProcessState.h</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">96</span></span><span class="org-underline">:</span>            Vector&lt;handle_entry&gt;mHandleToObject;
<span class="org-underline"><span class="org-compilation-info">/home/bhj/src/android/frameworks/native/libs/binder/ProcessState.cpp</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">172</span></span><span class="org-underline">:</span>    const size_t N=mHandleToObject.size();
<span class="org-underline"><span class="org-compilation-info">/home/bhj/src/android/frameworks/native/libs/binder/ProcessState.cpp</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">177</span></span><span class="org-underline">:</span>        status_t err = mHandleToObject.insertAt(e, N, handle+1-N);
<span class="org-underline"><span class="org-compilation-info">/home/bhj/src/android/frameworks/native/libs/binder/ProcessState.cpp</span></span><span class="org-underline">:</span><span class="org-underline"><span class="org-compilation-line-number">180</span></span><span class="org-underline">:</span>    return &amp;mHandleToObject.editItemAt(handle);

Grep finished (<span class="org-compilation-info">matches found</span>) at Sun Jul 27 22:16:08
</pre>
</div>

<p>
完了，mHandleToObject根本没有正规的初始化，都是在 lookupHandleLocked里
完成对它的操作的，如果handle没有找到的话，就放一个handle_entry进去跟这
个handle对应，其binder和refs均为空值。然后在 getStrongProxyForHandle里，
看到了 binder 成员为空，就会 new 一个 BpBinder(handle) 出来赋给它，这
样就建立起了BpBinder与handle之间的关系。
</p>

<p>
BpBinder有一个mHandle的成员变量，会被赋上这个handle的值，然后这个
mHandle 会在 transact 函数中用到：
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">status_t</span> <span class="org-constant">BpBinder</span>::<span class="org-function-name">transact</span>(
    <span class="org-type">uint32_t</span> <span class="org-variable-name">code</span>, <span class="org-keyword">const</span> <span class="org-type">Parcel</span>&amp; <span class="org-variable-name">data</span>, <span class="org-type">Parcel</span>* <span class="org-variable-name">reply</span>, <span class="org-type">uint32_t</span> <span class="org-variable-name">flags</span>)
{
    <span class="org-comment-delimiter">// </span><span class="org-comment">Once a binder has died, it will never come back to life.</span>
    <span class="org-keyword">if</span> (mAlive) {
        <span class="org-type">status_t</span> <span class="org-variable-name">status</span> = <span class="org-constant">IPCThreadState</span>::self()-&gt;transact(
            mHandle, code, data, reply, flags);
        <span class="org-keyword">if</span> (status == DEAD_OBJECT) mAlive = 0;
        <span class="org-keyword">return</span> status;
    }

    <span class="org-keyword">return</span> DEAD_OBJECT;
}
</pre>
</div>

<p>
会调到 IPCThreadState::self()-&gt;transact()：
</p>
<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">status_t</span> <span class="org-constant">IPCThreadState</span>::<span class="org-function-name">transact</span>(<span class="org-type">int32_t</span> <span class="org-variable-name">handle</span>,
                                  <span class="org-type">uint32_t</span> <span class="org-variable-name">code</span>, <span class="org-keyword">const</span> <span class="org-type">Parcel</span>&amp; <span class="org-variable-name">data</span>,
                                  <span class="org-type">Parcel</span>* <span class="org-variable-name">reply</span>, <span class="org-type">uint32_t</span> <span class="org-variable-name">flags</span>)
{
    <span class="org-type">status_t</span> <span class="org-variable-name">err</span> = data.errorCheck();

    flags |= TF_ACCEPT_FDS;

    <span class="org-keyword">if</span> (err == NO_ERROR) {
        err = writeTransactionData(BC_TRANSACTION, flags, handle, code, data, <span class="org-constant">NULL</span>);
    }

    <span class="org-keyword">if</span> (err != NO_ERROR) {
        <span class="org-keyword">if</span> (reply) reply-&gt;setError(err);
        <span class="org-keyword">return</span> (mLastError = err);
    }

    <span class="org-keyword">if</span> ((flags &amp; TF_ONE_WAY) == 0) {
        <span class="org-keyword">if</span> (reply) {
            err = waitForResponse(reply);
        } <span class="org-keyword">else</span> {
            <span class="org-type">Parcel</span> <span class="org-variable-name">fakeReply</span>;
            err = waitForResponse(&amp;fakeReply);
        }
    } <span class="org-keyword">else</span> {
        err = waitForResponse(<span class="org-constant">NULL</span>, <span class="org-constant">NULL</span>);
    }

    <span class="org-keyword">return</span> err;
}
</pre>
</div>
<p>
上面这个函数里所有的多余的注释和 <code>#if 0</code> 之类的代码都已经去掉了。所以其逻辑也比较明了，主要调了一个 writeTransactionData 和一个 waitForResponse 函数。
</p>

<p>
先看 writeTransactionData
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">status_t</span> <span class="org-constant">IPCThreadState</span>::<span class="org-function-name">writeTransactionData</span>(<span class="org-type">int32_t</span> <span class="org-variable-name">cmd</span>, <span class="org-type">uint32_t</span> <span class="org-variable-name">binderFlags</span>,
    <span class="org-type">int32_t</span> <span class="org-variable-name">handle</span>, <span class="org-type">uint32_t</span> <span class="org-variable-name">code</span>, <span class="org-keyword">const</span> <span class="org-type">Parcel</span>&amp; <span class="org-variable-name">data</span>, <span class="org-type">status_t</span>* <span class="org-variable-name">statusBuffer</span>)
{
    <span class="org-type">binder_transaction_data</span> <span class="org-variable-name">tr</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">&#36825;&#20010;struct&#26159;&#22312;kernel&#37324;&#23450;&#20041;&#30340;</span>

    tr.target.handle = handle;
    tr.code = code;
    tr.flags = binderFlags;
    tr.cookie = 0;
    tr.sender_pid = 0;
    tr.sender_euid = 0;

    <span class="org-keyword">const</span> <span class="org-type">status_t</span> <span class="org-variable-name">err</span> = data.errorCheck(); <span class="org-comment-delimiter">// </span><span class="org-comment">status_t &#26159; system/core/include/utils/Errors.h &#37324;&#23450;&#20041;&#30340;</span>
    <span class="org-keyword">if</span> (err == NO_ERROR) {
        tr.data_size = data.ipcDataSize();
        tr.data.ptr.buffer = data.ipcData();
        tr.offsets_size = data.ipcObjectsCount()*<span class="org-keyword">sizeof</span>(size_t);
        tr.data.ptr.offsets = data.ipcObjects();
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (statusBuffer) {
        tr.flags |= TF_STATUS_CODE;
        *statusBuffer = err;
        tr.data_size = <span class="org-keyword">sizeof</span>(status_t);
        tr.data.ptr.buffer = statusBuffer;
        tr.offsets_size = 0;
        tr.data.ptr.offsets = <span class="org-constant">NULL</span>;
    } <span class="org-keyword">else</span> {
        <span class="org-keyword">return</span> (mLastError = err);
    }

    mOut.writeInt32(cmd);
    mOut.write(&amp;tr, <span class="org-keyword">sizeof</span>(tr));

    <span class="org-keyword">return</span> NO_ERROR;
}
</pre>
</div>
<p>
code 在 IServiceManager 里是 一个如 Stub.TRANSACTION_registerListener
这样的值。 cmd刚才看到是 BC_TRANSACTION 。在transact调用里，
writeTransactionData 的 statusBuffer 的参数是 NULL，所以先不用看。然后
看到的是 mOut 里写了个 cmd，再写了个 tr ，这个函数就返回了，所以它跟内
核里的 binder 设备还没有交互过呢。
</p>

<p>
交互应该是在 waitForResponse 里:
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">status_t</span> <span class="org-constant">IPCThreadState</span>::<span class="org-function-name">waitForResponse</span>(<span class="org-type">Parcel</span> *<span class="org-variable-name">reply</span>, <span class="org-type">status_t</span> *<span class="org-variable-name">acquireResult</span>)
{
    <span class="org-type">int32_t</span> <span class="org-variable-name">cmd</span>;
    <span class="org-type">int32_t</span> <span class="org-variable-name">err</span>;

    <span class="org-keyword">while</span> (1) {
        <span class="org-keyword">if</span> ((err=talkWithDriver()) &lt; NO_ERROR) <span class="org-keyword">break</span>;
        err = mIn.errorCheck();
        <span class="org-keyword">if</span> (err &lt; NO_ERROR) <span class="org-keyword">break</span>;
        <span class="org-keyword">if</span> (mIn.dataAvail() == 0) <span class="org-keyword">continue</span>;

        cmd = mIn.readInt32();

        <span class="org-keyword">switch</span> (cmd) {
        <span class="org-keyword">case</span> BR_TRANSACTION_COMPLETE:
            <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>reply &amp;&amp; <span class="org-negation-char">!</span>acquireResult) <span class="org-keyword">goto</span> <span class="org-constant">finish</span>;
            <span class="org-keyword">break</span>;

        <span class="org-keyword">case</span> BR_DEAD_REPLY:
            err = DEAD_OBJECT;
            <span class="org-keyword">goto</span> <span class="org-constant">finish</span>;

        <span class="org-keyword">case</span> BR_FAILED_REPLY:
            err = FAILED_TRANSACTION;
            <span class="org-keyword">goto</span> <span class="org-constant">finish</span>;

        <span class="org-keyword">case</span> BR_ACQUIRE_RESULT:
            {
                ALOG_ASSERT(acquireResult != <span class="org-constant">NULL</span>, <span class="org-string">"Unexpected brACQUIRE_RESULT"</span>);
                <span class="org-keyword">const</span> <span class="org-type">int32_t</span> <span class="org-variable-name">result</span> = mIn.readInt32();
                <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>acquireResult) <span class="org-keyword">continue</span>;
                *acquireResult = result ? NO_ERROR : INVALID_OPERATION;
            }
            <span class="org-keyword">goto</span> <span class="org-constant">finish</span>;

        <span class="org-keyword">case</span> BR_REPLY:
            {
                <span class="org-type">binder_transaction_data</span> <span class="org-variable-name">tr</span>;
                err = mIn.read(&amp;tr, <span class="org-keyword">sizeof</span>(tr));
                ALOG_ASSERT(err == NO_ERROR, <span class="org-string">"Not enough command data for brREPLY"</span>);
                <span class="org-keyword">if</span> (err != NO_ERROR) <span class="org-keyword">goto</span> <span class="org-constant">finish</span>;

                <span class="org-keyword">if</span> (reply) {
                    <span class="org-keyword">if</span> ((tr.flags &amp; TF_STATUS_CODE) == 0) {
                        reply-&gt;ipcSetDataReference(
                            <span class="org-keyword">reinterpret_cast</span>&lt;<span class="org-keyword">const</span> uint8_t*&gt;(tr.data.ptr.buffer),
                            tr.data_size,
                            <span class="org-keyword">reinterpret_cast</span>&lt;<span class="org-keyword">const</span> size_t*&gt;(tr.data.ptr.offsets),
                            tr.offsets_size/<span class="org-keyword">sizeof</span>(size_t),
                            freeBuffer, <span class="org-keyword">this</span>);
                    } <span class="org-keyword">else</span> {
                        err = *<span class="org-keyword">static_cast</span>&lt;<span class="org-keyword">const</span> status_t*&gt;(tr.data.ptr.buffer);
                        freeBuffer(<span class="org-constant">NULL</span>,
                            <span class="org-keyword">reinterpret_cast</span>&lt;<span class="org-keyword">const</span> uint8_t*&gt;(tr.data.ptr.buffer),
                            tr.data_size,
                            <span class="org-keyword">reinterpret_cast</span>&lt;<span class="org-keyword">const</span> size_t*&gt;(tr.data.ptr.offsets),
                            tr.offsets_size/<span class="org-keyword">sizeof</span>(size_t), <span class="org-keyword">this</span>);
                    }
                } <span class="org-keyword">else</span> {
                    freeBuffer(<span class="org-constant">NULL</span>,
                        <span class="org-keyword">reinterpret_cast</span>&lt;<span class="org-keyword">const</span> uint8_t*&gt;(tr.data.ptr.buffer),
                        tr.data_size,
                        <span class="org-keyword">reinterpret_cast</span>&lt;<span class="org-keyword">const</span> size_t*&gt;(tr.data.ptr.offsets),
                        tr.offsets_size/<span class="org-keyword">sizeof</span>(size_t), <span class="org-keyword">this</span>);
                    <span class="org-keyword">continue</span>;
                }
            }
            <span class="org-keyword">goto</span> <span class="org-constant">finish</span>;

        <span class="org-keyword">default</span>:
            err = executeCommand(cmd);
            <span class="org-keyword">if</span> (err != NO_ERROR) <span class="org-keyword">goto</span> <span class="org-constant">finish</span>;
            <span class="org-keyword">break</span>;
        }
    }

<span class="org-constant">finish</span>:
    <span class="org-keyword">if</span> (err != NO_ERROR) {
        <span class="org-keyword">if</span> (acquireResult) *acquireResult = err;
        <span class="org-keyword">if</span> (reply) reply-&gt;setError(err);
        mLastError = err;
    }

    <span class="org-keyword">return</span> err;
}
</pre>
</div>

<p>
最关键的函数应该是那个 talkWithDriver 了，这个才真正把命令发过去，并把返回结果读回来。
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">status_t</span> <span class="org-constant">IPCThreadState</span>::<span class="org-function-name">talkWithDriver</span>(<span class="org-type">bool</span> <span class="org-variable-name">doReceive</span>)
{
    <span class="org-type">binder_write_read</span> <span class="org-variable-name">bwr</span>;

    <span class="org-comment-delimiter">// </span><span class="org-comment">Is the read buffer empty?</span>
    <span class="org-keyword">const</span> <span class="org-type">bool</span> <span class="org-variable-name">needRead</span> = mIn.dataPosition() &gt;= mIn.dataSize();

    <span class="org-comment-delimiter">// </span><span class="org-comment">We don't want to write anything if we are still reading</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">from data left in the input buffer and the caller</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">has requested to read the next data.</span>
    <span class="org-keyword">const</span> <span class="org-type">size_t</span> <span class="org-variable-name">outAvail</span> = (<span class="org-negation-char">!</span>doReceive || needRead) ? mOut.dataSize() : 0;

    bwr.write_size = outAvail;
    bwr.write_buffer = (<span class="org-type">long</span> <span class="org-type">unsigned</span> <span class="org-type">int</span>)mOut.data();

    <span class="org-comment-delimiter">// </span><span class="org-comment">This is what we'll read.</span>
    <span class="org-keyword">if</span> (doReceive &amp;&amp; needRead) {
        bwr.read_size = mIn.dataCapacity();
        bwr.read_buffer = (<span class="org-type">long</span> <span class="org-type">unsigned</span> <span class="org-type">int</span>)mIn.data();
    } <span class="org-keyword">else</span> {
        bwr.read_size = 0;
        bwr.read_buffer = 0;
    }

    <span class="org-comment-delimiter">// </span><span class="org-comment">Return immediately if there is nothing to do.</span>
    <span class="org-keyword">if</span> ((bwr.write_size == 0) &amp;&amp; (bwr.read_size == 0)) <span class="org-keyword">return</span> NO_ERROR;

    bwr.write_consumed = 0;
    bwr.read_consumed = 0;
    <span class="org-type">status_t</span> <span class="org-variable-name">err</span>;
    <span class="org-keyword">do</span> {
        <span class="org-keyword">if</span> (ioctl(mProcess-&gt;mDriverFD, BINDER_WRITE_READ, &amp;bwr) &gt;= 0)
            err = NO_ERROR;
        <span class="org-keyword">else</span>
            err = -errno;
        <span class="org-keyword">if</span> (mProcess-&gt;mDriverFD &lt;= 0) {
            err = -EBADF;
        }
    } <span class="org-keyword">while</span> (err == -EINTR);

    <span class="org-keyword">if</span> (err &gt;= NO_ERROR) {
        <span class="org-keyword">if</span> (bwr.write_consumed &gt; 0) {
            <span class="org-keyword">if</span> (bwr.write_consumed &lt; (<span class="org-type">ssize_t</span>)mOut.dataSize())
                mOut.remove(0, bwr.write_consumed);
            <span class="org-keyword">else</span>
                mOut.setDataSize(0);
        }
        <span class="org-keyword">if</span> (bwr.read_consumed &gt; 0) {
            mIn.setDataSize(bwr.read_consumed);
            mIn.setDataPosition(0);
        }
        <span class="org-keyword">return</span> NO_ERROR;
    }

    <span class="org-keyword">return</span> err;
}
</pre>
</div>

<p>
这里面的关键就在于一个简简单单的 ioctl(mProcess-&gt;mDriverFD, BINDER_WRITE_READ, &amp;bwr) 函数调用。
</p>

<p>
这个函数最后会调到kernel里：
</p>

<div class="org-src-container">

<pre class="src src-c"><span class="org-keyword">static</span> <span class="org-type">long</span> <span class="org-function-name">binder_ioctl</span>(<span class="org-keyword">struct</span> <span class="org-type">file</span> *<span class="org-variable-name">filp</span>, <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">cmd</span>, <span class="org-type">unsigned</span> <span class="org-type">long</span> <span class="org-variable-name">arg</span>)
{
        <span class="org-type">int</span> <span class="org-variable-name">ret</span>;
        <span class="org-keyword">struct</span> <span class="org-type">binder_proc</span> *<span class="org-variable-name">proc</span> = filp-&gt;private_data;
        <span class="org-keyword">struct</span> <span class="org-type">binder_thread</span> *<span class="org-variable-name">thread</span>;
        <span class="org-type">unsigned</span> <span class="org-type">int</span> <span class="org-variable-name">size</span> = _IOC_SIZE(cmd);
        <span class="org-type">void</span> <span class="org-variable-name">__user</span> *ubuf = (<span class="org-type">void</span> <span class="org-variable-name">__user</span> *)arg;

        <span class="org-comment-delimiter">/*</span><span class="org-comment">printk(KERN_INFO "binder_ioctl: %d:%d %x %lx\n", proc-&gt;pid, current-&gt;pid, cmd, arg);</span><span class="org-comment-delimiter">*/</span>

        ret = wait_event_interruptible(binder_user_error_wait, binder_stop_on_user_error &lt; 2);
        <span class="org-keyword">if</span> (ret)
                <span class="org-keyword">return</span> ret;

        mutex_lock(&amp;binder_lock);
        thread = binder_get_thread(proc);
        <span class="org-keyword">if</span> (thread == <span class="org-constant">NULL</span>) {
                ret = -ENOMEM;
                <span class="org-keyword">goto</span> <span class="org-constant">err</span>;
        }

        <span class="org-keyword">switch</span> (cmd) {
        <span class="org-keyword">case</span> BINDER_WRITE_READ: {
                <span class="org-keyword">struct</span> <span class="org-type">binder_write_read</span> <span class="org-variable-name">bwr</span>;
                <span class="org-keyword">if</span> (size != <span class="org-keyword">sizeof</span>(<span class="org-keyword">struct</span> <span class="org-type">binder_write_read</span>)) {
                        ret = -EINVAL;
                        <span class="org-keyword">goto</span> <span class="org-constant">err</span>;
                }
                <span class="org-keyword">if</span> (copy_from_user(&amp;bwr, ubuf, <span class="org-keyword">sizeof</span>(bwr))) {
                        ret = -EFAULT;
                        <span class="org-keyword">goto</span> <span class="org-constant">err</span>;
                }
                binder_debug(BINDER_DEBUG_READ_WRITE,
                             <span class="org-string">"binder: %d:%d write %ld at %08lx, read %ld at %08lx\n"</span>,
                             proc-&gt;pid, thread-&gt;pid, bwr.write_size, bwr.write_buffer,
                             bwr.read_size, bwr.read_buffer);

                <span class="org-keyword">if</span> (bwr.write_size &gt; 0) {
                        ret = binder_thread_write(proc, thread, (<span class="org-type">void</span> <span class="org-variable-name">__user</span> *)bwr.write_buffer, bwr.write_size, &amp;bwr.write_consumed);
                        <span class="org-keyword">if</span> (ret &lt; 0) {
                                bwr.read_consumed = 0;
                                <span class="org-keyword">if</span> (copy_to_user(ubuf, &amp;bwr, <span class="org-keyword">sizeof</span>(bwr)))
                                        ret = -EFAULT;
                                <span class="org-keyword">goto</span> <span class="org-constant">err</span>;
                        }
                }
                <span class="org-keyword">if</span> (bwr.read_size &gt; 0) {
                        ret = binder_thread_read(proc, thread, (<span class="org-type">void</span> <span class="org-variable-name">__user</span> *)bwr.read_buffer, bwr.read_size, &amp;bwr.read_consumed, filp-&gt;f_flags &amp; O_NONBLOCK);
                        <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>list_empty(&amp;proc-&gt;todo))
                                wake_up_interruptible(&amp;proc-&gt;wait);
                        <span class="org-keyword">if</span> (ret &lt; 0) {
                                <span class="org-keyword">if</span> (copy_to_user(ubuf, &amp;bwr, <span class="org-keyword">sizeof</span>(bwr)))
                                        ret = -EFAULT;
                                <span class="org-keyword">goto</span> <span class="org-constant">err</span>;
                        }
                }
                binder_debug(BINDER_DEBUG_READ_WRITE,
                             <span class="org-string">"binder: %d:%d wrote %ld of %ld, read return %ld of %ld\n"</span>,
                             proc-&gt;pid, thread-&gt;pid, bwr.write_consumed, bwr.write_size,
                             bwr.read_consumed, bwr.read_size);
                <span class="org-keyword">if</span> (copy_to_user(ubuf, &amp;bwr, <span class="org-keyword">sizeof</span>(bwr))) {
                        ret = -EFAULT;
                        <span class="org-keyword">goto</span> <span class="org-constant">err</span>;
                }
                <span class="org-keyword">break</span>;
        }
        <span class="org-keyword">case</span> BINDER_SET_MAX_THREADS:
                <span class="org-keyword">if</span> (copy_from_user(&amp;proc-&gt;max_threads, ubuf, <span class="org-keyword">sizeof</span>(proc-&gt;max_threads))) {
                        ret = -EINVAL;
                        <span class="org-keyword">goto</span> <span class="org-constant">err</span>;
                }
                <span class="org-keyword">break</span>;
        <span class="org-keyword">case</span> BINDER_SET_CONTEXT_MGR:
                <span class="org-keyword">if</span> (binder_context_mgr_node != <span class="org-constant">NULL</span>) {
                        binder_debug(BINDER_DEBUG_TOP_ERRORS,
                                     <span class="org-string">"binder: BINDER_SET_CONTEXT_MGR already set\n"</span>);
                        ret = -EBUSY;
                        <span class="org-keyword">goto</span> <span class="org-constant">err</span>;
                }
                ret = security_binder_set_context_mgr(proc-&gt;tsk);
                <span class="org-keyword">if</span> (ret &lt; 0)
                        <span class="org-keyword">goto</span> <span class="org-constant">err</span>;
                <span class="org-keyword">if</span> (binder_context_mgr_uid != -1) {
                        <span class="org-keyword">if</span> (binder_context_mgr_uid != current-&gt;cred-&gt;euid) {
                                binder_debug(BINDER_DEBUG_TOP_ERRORS,
                                             <span class="org-string">"binder: BINDER_SET_"</span>
                                             <span class="org-string">"CONTEXT_MGR bad uid %d != %d\n"</span>,
                                             current-&gt;cred-&gt;euid,
                                             binder_context_mgr_uid);
                                ret = -EPERM;
                                <span class="org-keyword">goto</span> <span class="org-constant">err</span>;
                        }
                } <span class="org-keyword">else</span>
                        binder_context_mgr_uid = current-&gt;cred-&gt;euid;
                binder_context_mgr_node = binder_new_node(proc, <span class="org-constant">NULL</span>, <span class="org-constant">NULL</span>);
                <span class="org-keyword">if</span> (binder_context_mgr_node == <span class="org-constant">NULL</span>) {
                        ret = -ENOMEM;
                        <span class="org-keyword">goto</span> <span class="org-constant">err</span>;
                }
                binder_context_mgr_node-&gt;local_weak_refs++;
                binder_context_mgr_node-&gt;local_strong_refs++;
                binder_context_mgr_node-&gt;has_strong_ref = 1;
                binder_context_mgr_node-&gt;has_weak_ref = 1;
                <span class="org-keyword">break</span>;
        <span class="org-keyword">case</span> BINDER_THREAD_EXIT:
                binder_debug(BINDER_DEBUG_THREADS, <span class="org-string">"binder: %d:%d exit\n"</span>,
                             proc-&gt;pid, thread-&gt;pid);
                binder_free_thread(proc, thread);
                thread = <span class="org-constant">NULL</span>;
                <span class="org-keyword">break</span>;
        <span class="org-keyword">case</span> BINDER_VERSION:
                <span class="org-keyword">if</span> (size != <span class="org-keyword">sizeof</span>(<span class="org-keyword">struct</span> <span class="org-type">binder_version</span>)) {
                        ret = -EINVAL;
                        <span class="org-keyword">goto</span> <span class="org-constant">err</span>;
                }
                <span class="org-keyword">if</span> (put_user(BINDER_CURRENT_PROTOCOL_VERSION, &amp;((<span class="org-keyword">struct</span> <span class="org-type">binder_version</span> *)ubuf)-&gt;protocol_version)) {
                        ret = -EINVAL;
                        <span class="org-keyword">goto</span> <span class="org-constant">err</span>;
                }
                <span class="org-keyword">break</span>;
        <span class="org-keyword">default</span>:
                ret = -EINVAL;
                <span class="org-keyword">goto</span> <span class="org-constant">err</span>;
        }
        ret = 0;
<span class="org-constant">err</span>:
        <span class="org-keyword">if</span> (thread)
                thread-&gt;looper &amp;= ~BINDER_LOOPER_STATE_NEED_RETURN;
        mutex_unlock(&amp;binder_lock);
        wait_event_interruptible(binder_user_error_wait, binder_stop_on_user_error &lt; 2);
        <span class="org-keyword">if</span> (ret &amp;&amp; ret != -ERESTARTSYS)
                binder_debug(BINDER_DEBUG_TOP_ERRORS,
                             <span class="org-string">"binder: %d:%d ioctl %x %lx returned %d\n"</span>,
                             proc-&gt;pid, current-&gt;pid, cmd, arg, ret);
        <span class="org-keyword">return</span> ret;
}
</pre>
</div>

<p>
上来就 <code>struct binder_proc *proc = filp-&gt;private_data;</code> ，这个proc/private_data是在哪里初始化的呢？在binder_open里：
</p>

<div class="org-src-container">

<pre class="src src-c"><span class="org-keyword">static</span> <span class="org-type">int</span> <span class="org-function-name">binder_open</span>(<span class="org-keyword">struct</span> <span class="org-type">inode</span> *<span class="org-variable-name">nodp</span>, <span class="org-keyword">struct</span> <span class="org-type">file</span> *<span class="org-variable-name">filp</span>)
{
        <span class="org-keyword">struct</span> <span class="org-type">binder_proc</span> *<span class="org-variable-name">proc</span>;

        binder_debug(BINDER_DEBUG_OPEN_CLOSE, <span class="org-string">"binder_open: %d:%d\n"</span>,
                     current-&gt;group_leader-&gt;pid, current-&gt;pid);

        proc = kzalloc(<span class="org-keyword">sizeof</span>(*proc), GFP_KERNEL);
        <span class="org-keyword">if</span> (proc == <span class="org-constant">NULL</span>)
                <span class="org-keyword">return</span> -ENOMEM;
        get_task_struct(current);
        proc-&gt;tsk = current;
        INIT_LIST_HEAD(&amp;proc-&gt;todo);
        init_waitqueue_head(&amp;proc-&gt;wait);
        proc-&gt;default_priority = task_nice(current);
        mutex_lock(&amp;binder_lock);
        binder_stats_created(BINDER_STAT_PROC);
        hlist_add_head(&amp;proc-&gt;proc_node, &amp;binder_procs);
        proc-&gt;pid = current-&gt;group_leader-&gt;pid;
        INIT_LIST_HEAD(&amp;proc-&gt;delivered_death);
        filp-&gt;private_data = proc;
        mutex_unlock(&amp;binder_lock);

        <span class="org-keyword">if</span> (binder_debugfs_dir_entry_proc) {
                <span class="org-type">char</span> <span class="org-variable-name">strbuf</span>[11];
                snprintf(strbuf, <span class="org-keyword">sizeof</span>(strbuf), <span class="org-string">"%u"</span>, proc-&gt;pid);
                proc-&gt;debugfs_entry = debugfs_create_file(strbuf, S_IRUGO,
                        binder_debugfs_dir_entry_proc, proc, &amp;binder_proc_fops);
        }

        <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<p>
binder_open是 binder 设备的打开文件方法：
</p>

<div class="org-src-container">

<pre class="src src-c"><span class="org-keyword">static</span> <span class="org-keyword">const</span> <span class="org-keyword">struct</span> <span class="org-type">file_operations</span> <span class="org-variable-name">binder_fops</span> = {
        .owner = THIS_MODULE,
        .poll = binder_poll,
        .unlocked_ioctl = binder_ioctl,
        .mmap = binder_mmap,
        .open = binder_open,
        .flush = binder_flush,
        .release = binder_release,
};
</pre>
</div>

<p>
如果需要写的话，就会调 binder_thread_write 函数：
</p>

<div class="org-src-container">

<pre class="src src-c"><span class="org-type">int</span> <span class="org-function-name">binder_thread_write</span>(<span class="org-keyword">struct</span> <span class="org-type">binder_proc</span> *<span class="org-variable-name">proc</span>, <span class="org-keyword">struct</span> <span class="org-type">binder_thread</span> *<span class="org-variable-name">thread</span>,
                        <span class="org-type">void</span> <span class="org-variable-name">__user</span> *buffer, <span class="org-type">int</span> <span class="org-variable-name">size</span>, <span class="org-type">signed</span> <span class="org-type">long</span> *<span class="org-variable-name">consumed</span>)
{
        <span class="org-type">uint32_t</span> <span class="org-variable-name">cmd</span>;
        <span class="org-type">void</span> <span class="org-variable-name">__user</span> *ptr = buffer + *consumed;
        <span class="org-type">void</span> <span class="org-variable-name">__user</span> *end = buffer + size;

        <span class="org-keyword">while</span> (ptr &lt; end &amp;&amp; thread-&gt;return_error == BR_OK) {
                <span class="org-keyword">if</span> (get_user(cmd, (uint32_t <span class="org-type">__user</span> *)ptr))
                        <span class="org-keyword">return</span> -EFAULT;
                ptr += <span class="org-keyword">sizeof</span>(uint32_t);
                <span class="org-keyword">if</span> (_IOC_NR(cmd) &lt; ARRAY_SIZE(binder_stats.bc)) {
                        binder_stats.bc[_IOC_NR(cmd)]++;
                        proc-&gt;stats.bc[_IOC_NR(cmd)]++;
                        thread-&gt;stats.bc[_IOC_NR(cmd)]++;
                }
                <span class="org-keyword">switch</span> (cmd) {
                <span class="org-keyword">case</span> BC_INCREFS:
                <span class="org-keyword">case</span> BC_ACQUIRE:
                <span class="org-keyword">case</span> BC_RELEASE:
                <span class="org-keyword">case</span> BC_DECREFS: {
                        <span class="org-type">uint32_t</span> <span class="org-variable-name">target</span>;
                        <span class="org-keyword">struct</span> <span class="org-type">binder_ref</span> *<span class="org-variable-name">ref</span>;
                        <span class="org-keyword">const</span> <span class="org-type">char</span> *<span class="org-variable-name">debug_string</span>;

                        <span class="org-keyword">if</span> (get_user(target, (uint32_t <span class="org-type">__user</span> *)ptr))
                                <span class="org-keyword">return</span> -EFAULT;
                        ptr += <span class="org-keyword">sizeof</span>(uint32_t);
                        <span class="org-keyword">if</span> (target == 0 &amp;&amp; binder_context_mgr_node &amp;&amp;
                            (cmd == BC_INCREFS || cmd == BC_ACQUIRE)) {
                                ref = binder_get_ref_for_node(proc,
                                               binder_context_mgr_node);
                                <span class="org-keyword">if</span> (ref-&gt;desc != target) {
                                        binder_user_error(<span class="org-string">"binder: %d:"</span>
                                                <span class="org-string">"%d tried to acquire "</span>
                                                <span class="org-string">"reference to desc 0, "</span>
                                                <span class="org-string">"got %d instead\n"</span>,
                                                proc-&gt;pid, thread-&gt;pid,
                                                ref-&gt;desc);
                                }
                        } <span class="org-keyword">else</span>
                                ref = binder_get_ref(proc, target);
                        <span class="org-keyword">if</span> (ref == <span class="org-constant">NULL</span>) {
                                binder_user_error(<span class="org-string">"binder: %d:%d refcou"</span>
                                        <span class="org-string">"nt change on invalid ref %d\n"</span>,
                                        proc-&gt;pid, thread-&gt;pid, target);
                                <span class="org-keyword">break</span>;
                        }
                        <span class="org-keyword">switch</span> (cmd) {
                        <span class="org-keyword">case</span> BC_INCREFS:
                                debug_string = <span class="org-string">"IncRefs"</span>;
                                binder_inc_ref(ref, 0, <span class="org-constant">NULL</span>);
                                <span class="org-keyword">break</span>;
                        <span class="org-keyword">case</span> BC_ACQUIRE:
                                debug_string = <span class="org-string">"Acquire"</span>;
                                binder_inc_ref(ref, 1, <span class="org-constant">NULL</span>);
                                <span class="org-keyword">break</span>;
                        <span class="org-keyword">case</span> BC_RELEASE:
                                debug_string = <span class="org-string">"Release"</span>;
                                binder_dec_ref(ref, 1);
                                <span class="org-keyword">break</span>;
                        <span class="org-keyword">case</span> BC_DECREFS:
                        <span class="org-keyword">default</span>:
                                debug_string = <span class="org-string">"DecRefs"</span>;
                                binder_dec_ref(ref, 0);
                                <span class="org-keyword">break</span>;
                        }
                        binder_debug(BINDER_DEBUG_USER_REFS,
                                     <span class="org-string">"binder: %d:%d %s ref %d desc %d s %d w %d for node %d\n"</span>,
                                     proc-&gt;pid, thread-&gt;pid, debug_string, ref-&gt;debug_id,
                                     ref-&gt;desc, ref-&gt;strong, ref-&gt;weak, ref-&gt;node-&gt;debug_id);
                        <span class="org-keyword">break</span>;
                }
                <span class="org-keyword">case</span> BC_INCREFS_DONE:
                <span class="org-keyword">case</span> BC_ACQUIRE_DONE: {
                        <span class="org-type">void</span> <span class="org-variable-name">__user</span> *node_ptr;
                        <span class="org-type">void</span> *<span class="org-variable-name">cookie</span>;
                        <span class="org-keyword">struct</span> <span class="org-type">binder_node</span> *<span class="org-variable-name">node</span>;

                        <span class="org-keyword">if</span> (get_user(node_ptr, (<span class="org-type">void</span> * <span class="org-variable-name">__user</span> *)ptr))
                                <span class="org-keyword">return</span> -EFAULT;
                        ptr += <span class="org-keyword">sizeof</span>(<span class="org-type">void</span> *);
                        <span class="org-keyword">if</span> (get_user(cookie, (<span class="org-type">void</span> * <span class="org-variable-name">__user</span> *)ptr))
                                <span class="org-keyword">return</span> -EFAULT;
                        ptr += <span class="org-keyword">sizeof</span>(<span class="org-type">void</span> *);
                        node = binder_get_node(proc, node_ptr);
                        <span class="org-keyword">if</span> (node == <span class="org-constant">NULL</span>) {
                                binder_user_error(<span class="org-string">"binder: %d:%d "</span>
                                        <span class="org-string">"%s u%p no match\n"</span>,
                                        proc-&gt;pid, thread-&gt;pid,
                                        cmd == BC_INCREFS_DONE ?
                                        <span class="org-string">"BC_INCREFS_DONE"</span> :
                                        <span class="org-string">"BC_ACQUIRE_DONE"</span>,
                                        node_ptr);
                                <span class="org-keyword">break</span>;
                        }
                        <span class="org-keyword">if</span> (cookie != node-&gt;cookie) {
                                binder_user_error(<span class="org-string">"binder: %d:%d %s u%p node %d"</span>
                                        <span class="org-string">" cookie mismatch %p != %p\n"</span>,
                                        proc-&gt;pid, thread-&gt;pid,
                                        cmd == BC_INCREFS_DONE ?
                                        <span class="org-string">"BC_INCREFS_DONE"</span> : <span class="org-string">"BC_ACQUIRE_DONE"</span>,
                                        node_ptr, node-&gt;debug_id,
                                        cookie, node-&gt;cookie);
                                <span class="org-keyword">break</span>;
                        }
                        <span class="org-keyword">if</span> (cmd == BC_ACQUIRE_DONE) {
                                <span class="org-keyword">if</span> (node-&gt;pending_strong_ref == 0) {
                                        binder_user_error(<span class="org-string">"binder: %d:%d "</span>
                                                <span class="org-string">"BC_ACQUIRE_DONE node %d has "</span>
                                                <span class="org-string">"no pending acquire request\n"</span>,
                                                proc-&gt;pid, thread-&gt;pid,
                                                node-&gt;debug_id);
                                        <span class="org-keyword">break</span>;
                                }
                                node-&gt;pending_strong_ref = 0;
                        } <span class="org-keyword">else</span> {
                                <span class="org-keyword">if</span> (node-&gt;pending_weak_ref == 0) {
                                        binder_user_error(<span class="org-string">"binder: %d:%d "</span>
                                                <span class="org-string">"BC_INCREFS_DONE node %d has "</span>
                                                <span class="org-string">"no pending increfs request\n"</span>,
                                                proc-&gt;pid, thread-&gt;pid,
                                                node-&gt;debug_id);
                                        <span class="org-keyword">break</span>;
                                }
                                node-&gt;pending_weak_ref = 0;
                        }
                        binder_dec_node(node, cmd == BC_ACQUIRE_DONE, 0);
                        binder_debug(BINDER_DEBUG_USER_REFS,
                                     <span class="org-string">"binder: %d:%d %s node %d ls %d lw %d\n"</span>,
                                     proc-&gt;pid, thread-&gt;pid,
                                     cmd == BC_INCREFS_DONE ? <span class="org-string">"BC_INCREFS_DONE"</span> : <span class="org-string">"BC_ACQUIRE_DONE"</span>,
                                     node-&gt;debug_id, node-&gt;local_strong_refs, node-&gt;local_weak_refs);
                        <span class="org-keyword">break</span>;
                }
                <span class="org-keyword">case</span> BC_ATTEMPT_ACQUIRE:
                        binder_debug(BINDER_DEBUG_TOP_ERRORS,
                                     <span class="org-string">"binder: BC_ATTEMPT_ACQUIRE not supported\n"</span>);
                        <span class="org-keyword">return</span> -EINVAL;
                <span class="org-keyword">case</span> BC_ACQUIRE_RESULT:
                        binder_debug(BINDER_DEBUG_TOP_ERRORS,
                                     <span class="org-string">"binder: BC_ACQUIRE_RESULT not supported\n"</span>);
                        <span class="org-keyword">return</span> -EINVAL;

                <span class="org-keyword">case</span> BC_FREE_BUFFER: {
                        <span class="org-type">void</span> <span class="org-variable-name">__user</span> *data_ptr;
                        <span class="org-keyword">struct</span> <span class="org-type">binder_buffer</span> *<span class="org-variable-name">buffer</span>;

                        <span class="org-keyword">if</span> (get_user(data_ptr, (<span class="org-type">void</span> * <span class="org-variable-name">__user</span> *)ptr))
                                <span class="org-keyword">return</span> -EFAULT;
                        ptr += <span class="org-keyword">sizeof</span>(<span class="org-type">void</span> *);

                        buffer = binder_buffer_lookup(proc, data_ptr);
                        <span class="org-keyword">if</span> (buffer == <span class="org-constant">NULL</span>) {
                                binder_user_error(<span class="org-string">"binder: %d:%d "</span>
                                        <span class="org-string">"BC_FREE_BUFFER u%p no match\n"</span>,
                                        proc-&gt;pid, thread-&gt;pid, data_ptr);
                                <span class="org-keyword">break</span>;
                        }
                        <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>buffer-&gt;allow_user_free) {
                                binder_user_error(<span class="org-string">"binder: %d:%d "</span>
                                        <span class="org-string">"BC_FREE_BUFFER u%p matched "</span>
                                        <span class="org-string">"unreturned buffer\n"</span>,
                                        proc-&gt;pid, thread-&gt;pid, data_ptr);
                                <span class="org-keyword">break</span>;
                        }
                        binder_debug(BINDER_DEBUG_FREE_BUFFER,
                                     <span class="org-string">"binder: %d:%d BC_FREE_BUFFER u%p found buffer %d for %s transaction\n"</span>,
                                     proc-&gt;pid, thread-&gt;pid, data_ptr, buffer-&gt;debug_id,
                                     buffer-&gt;transaction ? <span class="org-string">"active"</span> : <span class="org-string">"finished"</span>);

                        <span class="org-keyword">if</span> (buffer-&gt;transaction) {
                                buffer-&gt;transaction-&gt;buffer = <span class="org-constant">NULL</span>;
                                buffer-&gt;transaction = <span class="org-constant">NULL</span>;
                        }
                        <span class="org-keyword">if</span> (buffer-&gt;async_transaction &amp;&amp; buffer-&gt;target_node) {
                                BUG_ON(<span class="org-negation-char">!</span>buffer-&gt;target_node-&gt;has_async_transaction);
                                <span class="org-keyword">if</span> (list_empty(&amp;buffer-&gt;target_node-&gt;async_todo))
                                        buffer-&gt;target_node-&gt;has_async_transaction = 0;
                                <span class="org-keyword">else</span>
                                        list_move_tail(buffer-&gt;target_node-&gt;async_todo.next, &amp;thread-&gt;todo);
                        }
                        binder_transaction_buffer_release(proc, buffer, <span class="org-constant">NULL</span>);
                        binder_free_buf(proc, buffer);
                        <span class="org-keyword">break</span>;
                }

                <span class="org-keyword">case</span> BC_TRANSACTION:
                <span class="org-keyword">case</span> BC_REPLY: {
                        <span class="org-keyword">struct</span> <span class="org-type">binder_transaction_data</span> <span class="org-variable-name">tr</span>;

                        <span class="org-keyword">if</span> (copy_from_user(&amp;tr, ptr, <span class="org-keyword">sizeof</span>(tr)))
                                <span class="org-keyword">return</span> -EFAULT;
                        ptr += <span class="org-keyword">sizeof</span>(tr);
                        binder_transaction(proc, thread, &amp;tr, cmd == BC_REPLY);
                        <span class="org-keyword">break</span>;
                }

                <span class="org-keyword">case</span> BC_REGISTER_LOOPER:
                        binder_debug(BINDER_DEBUG_THREADS,
                                     <span class="org-string">"binder: %d:%d BC_REGISTER_LOOPER\n"</span>,
                                     proc-&gt;pid, thread-&gt;pid);
                        <span class="org-keyword">if</span> (thread-&gt;looper &amp; BINDER_LOOPER_STATE_ENTERED) {
                                thread-&gt;looper |= BINDER_LOOPER_STATE_INVALID;
                                binder_user_error(<span class="org-string">"binder: %d:%d ERROR:"</span>
                                        <span class="org-string">" BC_REGISTER_LOOPER called "</span>
                                        <span class="org-string">"after BC_ENTER_LOOPER\n"</span>,
                                        proc-&gt;pid, thread-&gt;pid);
                        } <span class="org-keyword">else</span> <span class="org-keyword">if</span> (proc-&gt;requested_threads == 0) {
                                thread-&gt;looper |= BINDER_LOOPER_STATE_INVALID;
                                binder_user_error(<span class="org-string">"binder: %d:%d ERROR:"</span>
                                        <span class="org-string">" BC_REGISTER_LOOPER called "</span>
                                        <span class="org-string">"without request\n"</span>,
                                        proc-&gt;pid, thread-&gt;pid);
                        } <span class="org-keyword">else</span> {
                                proc-&gt;requested_threads--;
                                proc-&gt;requested_threads_started++;
                        }
                        thread-&gt;looper |= BINDER_LOOPER_STATE_REGISTERED;
                        <span class="org-keyword">break</span>;
                <span class="org-keyword">case</span> BC_ENTER_LOOPER:
                        binder_debug(BINDER_DEBUG_THREADS,
                                     <span class="org-string">"binder: %d:%d BC_ENTER_LOOPER\n"</span>,
                                     proc-&gt;pid, thread-&gt;pid);
                        <span class="org-keyword">if</span> (thread-&gt;looper &amp; BINDER_LOOPER_STATE_REGISTERED) {
                                thread-&gt;looper |= BINDER_LOOPER_STATE_INVALID;
                                binder_user_error(<span class="org-string">"binder: %d:%d ERROR:"</span>
                                        <span class="org-string">" BC_ENTER_LOOPER called after "</span>
                                        <span class="org-string">"BC_REGISTER_LOOPER\n"</span>,
                                        proc-&gt;pid, thread-&gt;pid);
                        }
                        thread-&gt;looper |= BINDER_LOOPER_STATE_ENTERED;
                        <span class="org-keyword">break</span>;
                <span class="org-keyword">case</span> BC_EXIT_LOOPER:
                        binder_debug(BINDER_DEBUG_THREADS,
                                     <span class="org-string">"binder: %d:%d BC_EXIT_LOOPER\n"</span>,
                                     proc-&gt;pid, thread-&gt;pid);
                        thread-&gt;looper |= BINDER_LOOPER_STATE_EXITED;
                        <span class="org-keyword">break</span>;

                <span class="org-keyword">case</span> BC_REQUEST_DEATH_NOTIFICATION:
                <span class="org-keyword">case</span> BC_CLEAR_DEATH_NOTIFICATION: {
                        <span class="org-type">uint32_t</span> <span class="org-variable-name">target</span>;
                        <span class="org-type">void</span> <span class="org-variable-name">__user</span> *cookie;
                        <span class="org-keyword">struct</span> <span class="org-type">binder_ref</span> *<span class="org-variable-name">ref</span>;
                        <span class="org-keyword">struct</span> <span class="org-type">binder_ref_death</span> *<span class="org-variable-name">death</span>;

                        <span class="org-keyword">if</span> (get_user(target, (uint32_t <span class="org-type">__user</span> *)ptr))
                                <span class="org-keyword">return</span> -EFAULT;
                        ptr += <span class="org-keyword">sizeof</span>(uint32_t);
                        <span class="org-keyword">if</span> (get_user(cookie, (<span class="org-type">void</span> <span class="org-variable-name">__user</span> * __user *)ptr))
                                <span class="org-keyword">return</span> -EFAULT;
                        ptr += <span class="org-keyword">sizeof</span>(<span class="org-type">void</span> *);
                        ref = binder_get_ref(proc, target);
                        <span class="org-keyword">if</span> (ref == <span class="org-constant">NULL</span>) {
                                binder_user_error(<span class="org-string">"binder: %d:%d %s "</span>
                                        <span class="org-string">"invalid ref %d\n"</span>,
                                        proc-&gt;pid, thread-&gt;pid,
                                        cmd == BC_REQUEST_DEATH_NOTIFICATION ?
                                        <span class="org-string">"BC_REQUEST_DEATH_NOTIFICATION"</span> :
                                        <span class="org-string">"BC_CLEAR_DEATH_NOTIFICATION"</span>,
                                        target);
                                <span class="org-keyword">break</span>;
                        }

                        binder_debug(BINDER_DEBUG_DEATH_NOTIFICATION,
                                     <span class="org-string">"binder: %d:%d %s %p ref %d desc %d s %d w %d for node %d\n"</span>,
                                     proc-&gt;pid, thread-&gt;pid,
                                     cmd == BC_REQUEST_DEATH_NOTIFICATION ?
                                     <span class="org-string">"BC_REQUEST_DEATH_NOTIFICATION"</span> :
                                     <span class="org-string">"BC_CLEAR_DEATH_NOTIFICATION"</span>,
                                     cookie, ref-&gt;debug_id, ref-&gt;desc,
                                     ref-&gt;strong, ref-&gt;weak, ref-&gt;node-&gt;debug_id);

                        <span class="org-keyword">if</span> (cmd == BC_REQUEST_DEATH_NOTIFICATION) {
                                <span class="org-keyword">if</span> (ref-&gt;death) {
                                        binder_user_error(<span class="org-string">"binder: %d:%"</span>
                                                <span class="org-string">"d BC_REQUEST_DEATH_NOTI"</span>
                                                <span class="org-string">"FICATION death notific"</span>
                                                <span class="org-string">"ation already set\n"</span>,
                                                proc-&gt;pid, thread-&gt;pid);
                                        <span class="org-keyword">break</span>;
                                }
                                death = kzalloc(<span class="org-keyword">sizeof</span>(*death), GFP_KERNEL);
                                <span class="org-keyword">if</span> (death == <span class="org-constant">NULL</span>) {
                                        thread-&gt;return_error = BR_ERROR;
                                        binder_debug(BINDER_DEBUG_FAILED_TRANSACTION,
                                                     <span class="org-string">"binder: %d:%d "</span>
                                                     <span class="org-string">"BC_REQUEST_DEATH_NOTIFICATION failed\n"</span>,
                                                     proc-&gt;pid, thread-&gt;pid);
                                        <span class="org-keyword">break</span>;
                                }
                                binder_stats_created(BINDER_STAT_DEATH);
                                INIT_LIST_HEAD(&amp;death-&gt;work.entry);
                                death-&gt;cookie = cookie;
                                ref-&gt;death = death;
                                <span class="org-keyword">if</span> (ref-&gt;node-&gt;proc == <span class="org-constant">NULL</span>) {
                                        ref-&gt;death-&gt;work.type = BINDER_WORK_DEAD_BINDER;
                                        <span class="org-keyword">if</span> (thread-&gt;looper &amp; (BINDER_LOOPER_STATE_REGISTERED | BINDER_LOOPER_STATE_ENTERED)) {
                                                list_add_tail(&amp;ref-&gt;death-&gt;work.entry, &amp;thread-&gt;todo);
                                        } <span class="org-keyword">else</span> {
                                                list_add_tail(&amp;ref-&gt;death-&gt;work.entry, &amp;proc-&gt;todo);
                                                wake_up_interruptible(&amp;proc-&gt;wait);
                                        }
                                }
                        } <span class="org-keyword">else</span> {
                                <span class="org-keyword">if</span> (ref-&gt;death == <span class="org-constant">NULL</span>) {
                                        binder_user_error(<span class="org-string">"binder: %d:%"</span>
                                                <span class="org-string">"d BC_CLEAR_DEATH_NOTIFI"</span>
                                                <span class="org-string">"CATION death notificat"</span>
                                                <span class="org-string">"ion not active\n"</span>,
                                                proc-&gt;pid, thread-&gt;pid);
                                        <span class="org-keyword">break</span>;
                                }
                                death = ref-&gt;death;
                                <span class="org-keyword">if</span> (death-&gt;cookie != cookie) {
                                        binder_user_error(<span class="org-string">"binder: %d:%"</span>
                                                <span class="org-string">"d BC_CLEAR_DEATH_NOTIFI"</span>
                                                <span class="org-string">"CATION death notificat"</span>
                                                <span class="org-string">"ion cookie mismatch "</span>
                                                <span class="org-string">"%p != %p\n"</span>,
                                                proc-&gt;pid, thread-&gt;pid,
                                                death-&gt;cookie, cookie);
                                        <span class="org-keyword">break</span>;
                                }
                                ref-&gt;death = <span class="org-constant">NULL</span>;
                                <span class="org-keyword">if</span> (list_empty(&amp;death-&gt;work.entry)) {
                                        death-&gt;work.type = BINDER_WORK_CLEAR_DEATH_NOTIFICATION;
                                        <span class="org-keyword">if</span> (thread-&gt;looper &amp; (BINDER_LOOPER_STATE_REGISTERED | BINDER_LOOPER_STATE_ENTERED)) {
                                                list_add_tail(&amp;death-&gt;work.entry, &amp;thread-&gt;todo);
                                        } <span class="org-keyword">else</span> {
                                                list_add_tail(&amp;death-&gt;work.entry, &amp;proc-&gt;todo);
                                                wake_up_interruptible(&amp;proc-&gt;wait);
                                        }
                                } <span class="org-keyword">else</span> {
                                        BUG_ON(death-&gt;work.type != BINDER_WORK_DEAD_BINDER);
                                        death-&gt;work.type = BINDER_WORK_DEAD_BINDER_AND_CLEAR;
                                }
                        }
                } <span class="org-keyword">break</span>;
                <span class="org-keyword">case</span> BC_DEAD_BINDER_DONE: {
                        <span class="org-keyword">struct</span> <span class="org-type">binder_work</span> *<span class="org-variable-name">w</span>;
                        <span class="org-type">void</span> <span class="org-variable-name">__user</span> *cookie;
                        <span class="org-keyword">struct</span> <span class="org-type">binder_ref_death</span> *<span class="org-variable-name">death</span> = <span class="org-constant">NULL</span>;
                        <span class="org-keyword">if</span> (get_user(cookie, (<span class="org-type">void</span> <span class="org-variable-name">__user</span> * __user *)ptr))
                                <span class="org-keyword">return</span> -EFAULT;

                        ptr += <span class="org-keyword">sizeof</span>(<span class="org-type">void</span> *);
                        <span class="org-variable-name">list_for_each_entry</span>(w, &amp;proc-&gt;delivered_death, entry) {
                                <span class="org-keyword">struct</span> <span class="org-type">binder_ref_death</span> *<span class="org-variable-name">tmp_death</span> = container_of(w, <span class="org-keyword">struct</span> <span class="org-type">binder_ref_death</span>, work);
                                <span class="org-keyword">if</span> (tmp_death-&gt;cookie == cookie) {
                                        death = tmp_death;
                                        <span class="org-keyword">break</span>;
                                }
                        }
                        binder_debug(BINDER_DEBUG_DEAD_BINDER,
                                     <span class="org-string">"binder: %d:%d BC_DEAD_BINDER_DONE %p found %p\n"</span>,
                                     proc-&gt;pid, thread-&gt;pid, cookie, death);
                        <span class="org-keyword">if</span> (death == <span class="org-constant">NULL</span>) {
                                binder_user_error(<span class="org-string">"binder: %d:%d BC_DEAD"</span>
                                        <span class="org-string">"_BINDER_DONE %p not found\n"</span>,
                                        proc-&gt;pid, thread-&gt;pid, cookie);
                                <span class="org-keyword">break</span>;
                        }

                        list_del_init(&amp;death-&gt;work.entry);
                        <span class="org-keyword">if</span> (death-&gt;work.type == BINDER_WORK_DEAD_BINDER_AND_CLEAR) {
                                death-&gt;work.type = BINDER_WORK_CLEAR_DEATH_NOTIFICATION;
                                <span class="org-keyword">if</span> (thread-&gt;looper &amp; (BINDER_LOOPER_STATE_REGISTERED | BINDER_LOOPER_STATE_ENTERED)) {
                                        list_add_tail(&amp;death-&gt;work.entry, &amp;thread-&gt;todo);
                                } <span class="org-keyword">else</span> {
                                        list_add_tail(&amp;death-&gt;work.entry, &amp;proc-&gt;todo);
                                        wake_up_interruptible(&amp;proc-&gt;wait);
                                }
                        }
                } <span class="org-keyword">break</span>;

                <span class="org-keyword">default</span>:
                        binder_debug(BINDER_DEBUG_TOP_ERRORS,
                                     <span class="org-string">"binder: %d:%d unknown command %d\n"</span>,
                                     proc-&gt;pid, thread-&gt;pid, cmd);
                        <span class="org-keyword">return</span> -EINVAL;
                }
                *consumed = ptr - buffer;
        }
        <span class="org-keyword">return</span> 0;
}
</pre>
</div>
</div>
