blog/2014/06/04/0-binder.org
** TODO 把binder底下的各个数据结构搞清楚，每个成员变量都是干什么用的。
  - State "TODO"       from ""           [2014-07-30 Wed 18:26]

** TODO 为什么要 binder_set_nice
   - State "TODO"       from ""           [2014-07-30 Wed 20:19]

