blog/2014/06/04/0-binder.html
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> 把binder底下的各个数据结构搞清楚，每个成员变量都是干什么用的。</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2014-07-30 Wed 18:26]</span></span>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> <span class="todo TODO">TODO</span> 为什么要 binder_set_nice</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>State "TODO"       from ""           <span class="timestamp-wrapper"><span class="timestamp">[2014-07-30 Wed 20:19]</span></span>
</li>
</ul>
</div>
</div>
